null
{
  "chunk_index": 0,
  "section_name": null,
  "subsection_name": "",
  "text": "AGREEMENT AND PLAN OF MERGER by and among [ACQUIROR], INC., a Delaware corporation, [ACQUISITION SUB], INC., a Delaware corporation, and [TARGET], INC., a Delaware corporation\nDated as of",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 2,
  "section_name": null,
  "subsection_name": "TABLE OF CONTENTS",
  "text": " | ARTICLE 1 DESCRIPTION OF TRANSACTION | 4\n | --- | ---\n | 1.1 MERGER OF MERGER SUB INTO THE COMPANY | 4\n | 1.2 EFFECT OF THE MERGER | 4\n | 1.3 CLOSING; EFFECTIVE TIME | 4\n | 1.4 CERTIFICATE OF INCORPORATION AND BYLAWS; DIRECTORS AND OFFICERS | 5\n | 1.5 CONVERSION OF SHARES | 5\n | 1.6 CLOSING OF THE COMPANY’S TRANSFER BOOKS | 6\n | 1.7 EXCHANGE OF CERTIFICATES | 6\n | 1.8 TAX CONSEQUENCES | 8\n | 1.9 FURTHER ACTION | 8\n | ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY | 9\n | 2.1 ORGANIZATION AND GOOD STANDING | 9\n | 2.2 AUTHORITY; NO CONFLICT | 9\n | 2.3 AUTHORIZED CAPITAL | 11\n | 2.4 SEC REPORTS | 13\n | 2.5 FINANCIAL STATEMENTS | 15\n | 2.6 NO UNDISCLOSED LIABILITIES. | 16\n | 2.7 ABSENCE OF CERTAIN CHANGES AND EVENTS | 16\n | 2.8 INTELLECTUAL PROPERTY; PRIVACY. | 16\n | 2.9 PROPERTY; SUFFICIENCY OF ASSETS | 17\n | 2.10 TAXES | 18\n | 2.11 EMPLOYEE BENEFITS. | 22\n | 2.12 COMPLIANCE WITH LEGAL REQUIREMENTS; GOVERNMENTAL AUTHORIZATIONS | 26\n | 2.13 ENVIRONMENTAL MATTERS | 26\n | 2.14 LEGAL PROCEEDINGS | 28\n | 2.15 CONTRACTS; NO DEFAULTS | 29\n | 2.16 INSURANCE | 31\n | 2.17 LABOR AND EMPLOYMENT MATTERS | 32\n | 2.18 INTERESTS OF OFFICERS AND DIRECTORS | 33\n | 2.19 COMPLIANCE WITH U.S. FOREIGN CORRUPT PRACTICES ACT AND OTHER APPLICABLE ANTICORRUPTION LAWS. | 33\n | 2.20 RIGHTS PLAN; STATE ANTITAKEOVER STATUTES. | 33\n | 2.21 OPINION OF FINANCIAL ADVISOR | 34\n | 2.22 BROKERS | 34\n | 2.23 FULL DISCLOSURE | 34\n | ARTICLE 3 REPRESENTATIONS AND WARRANTIES OF PARENT AND MERGER SUB | 35\n | 3.1 ORGANIZATION AND GOOD STANDING | 35\n | 3.2 AUTHORITY; NO CONFLICT | 35\n | 3.3 CAPITALIZATION | 37\n | 3.4 PARENT SEC REPORTS | 37\n | 3.5 | FINANCIAL STATEMENTS\n\n | ARTICLE 4 CERTAIN COVENANTS | 39\n | --- | ---\n | 4.1 OPERATION OF THE COMPANY’S BUSINESS | 39\n | 4.2 ACCESS AND INVESTIGATION | 42\n | 4.3 NOTIFICATION | 43\n | 4.4 NO SOLICITATION | 43\n | 4.5 REGISTRATION STATEMENT; PROXY STATEMENT | 45\n | 4.6 COMPANY STOCKHOLDERS MEETING | 46\n | 4.7 COOPERATION; REGULATORY APPROVALS | 48\n | 4.8 DISCLOSURE | 50\n | 4.9 TAX MATTERS | 50\n | 4.10 RESIGNATION OF DIRECTORS | 50\n | 4.11 LISTING | 50\n | 4.12 PARENT BOARD | 50\n | 4.13 COMPANY RIGHTS AGREEMENT | 50\n | 4.14 RULE 16B-3. | 50\n | 4.15 STOCK PLANS | 51\n | 4.16 EMPLOYEE BENEFITS | 53\n | 4.17 INDEMNIFICATION OF OFFICERS AND DIRECTORS | 54\n | ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB | 55\n | 5.1 ACCURACY OF REPRESENTATIONS | 55\n | 5.2 PERFORMANCE OF COVENANTS | 55\n | 5.3 CERTIFICATE | 55\n | 5.4 EFFECTIVENESS OF FORM S-4 REGISTRATION STATEMENT | 55\n | 5.5 STOCKHOLDER APPROVAL | 55\n | 5.6 LISTING | 55\n | 5.7 NO MATERIAL ADVERSE EFFECT | 55\n | 5.8 COMPETITION LAWS | 56\n | 5.9 CONSENTS | 56\n | 5.10 NO RESTRAINTS | 56\n | 5.11 NO LITIGATION | 56\n | 5.12 TAX OPINION | 56\n | ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY | 57\n | 6.1 ACCURACY OF REPRESENTATIONS | 57\n | 6.2 PERFORMANCE OF COVENANTS | 57\n | 6.3 CERTIFICATE | 57\n | 6.4 EFFECTIVENESS OF FORM S-4 REGISTRATION STATEMENT | 57\n | 6.5 STOCKHOLDER APPROVAL | 57\n | 6.6 LISTING | 57\n | 6.7 COMPETITION LAWS | 57\n | 6.8 NO RESTRAINTS | 57\n | 6.9 TAX OPINION | 58\n | ARTICLE 7 TERMINATION | 59\n | 7.1 TERMINATION | 59\n | 7.2 | EFFECT OF TERMINATION\n | 7.3 EXPENSES; TERMINATION FEES | 60\n | ARTICLE 8 MISCELLANEOUS PROVISIONS | 63\n | 8.1 AMENDMENT | 63\n | 8.2 | REMEDIES CUMULATIVE; WAIVER63\n | 8.3 NO SURVIVAL | 63\n | 8.4 ENTIRE AGREEMENT | 63\n | 8.5 EXECUTION OF AGREEMENT; COUNTERPARTS; ELECTRONIC SIGNATURES | 64\n | 8.6 GOVERNING LAW | 64\n | 8.7 EXCLUSIVE JURISDICTION; VENUE | 64\n | 8.8 WAIVER OF JURY TRIAL | 65\n | 8.9 DISCLOSURE SCHEDULES | 65\n | 8.10 ASSIGNMENTS AND SUCCESSORS | 65\n | 8.11 NO THIRD-PARTY RIGHTS | 65\n | 8.12 NOTICES | 65\n | 8.13 CONSTRUCTION; USAGE | 66\n | 8.14 ENFORCEMENT OF AGREEMENT | 67\n | 8.15 SEVERABILITY | 67\n",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 4,
  "section_name": null,
  "subsection_name": "AGREEMENT AND PLAN OF MERGER",
  "text": "THIS AGREEMENT AND PLAN OF MERGER (“Agreement”) is made and entered into as of, 20, by and among: [ACQUIROR], INC., a Delaware corporation (“Parent”); [ACQUISITION SUB], INC., a Delaware corporation and a wholly owned subsidiary of Parent (“Merger Sub”); and [TARGET], INC., a Delaware corporation (the “Company”). Certain capitalized terms used in this Agreement are defined in Section 8.16.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 5,
  "section_name": null,
  "subsection_name": "RECITALS",
  "text": "A. Parent, Merger Sub, and the Company intend to effect a merger of Merger Sub with and into the Company (the “Merger”) in accordance with this Agreement and the Delaware General Corporation Law (“DGCL”). Upon consummation of the Merger, Merger Sub will cease to exist and the Company will become a wholly owned subsidiary of Parent.\nB. It is intended that the Merger qualify as a tax-free reorganization within the meaning of Section 368(a) of the Internal Revenue Code of 1986, as amended (the “Code”).\nC. The respective boards of directors of Parent, Merger Sub and the Company have approved this Agreement and approved the Merger.\nD. As an inducement to Parent to enter into this Agreement, certain stockholders of the Company have entered voting agreements dated as of the date hereof.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 9,
  "section_name": null,
  "subsection_name": "AGREEMENT",
  "text": "The parties to this Agreement, intending to be legally bound, agree as follows:",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 10,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.1 MERGER OF MERGER SUB INTO THE COMPANY",
  "text": "Upon the terms and subject to the conditions set forth in this Agreement, at the Effective Time, Merger Sub shall be merged with and into the Company and the separate existence of Merger Sub shall cease.\nFollowing the Effective Time, the Company shall continue as the surviving corporation of the Merger (the “Surviving Corporation”).",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 11,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.2 EFFECT OF THE MERGER",
  "text": "The Merger shall have the effects set forth in this Agreement and in the applicable provisions of the DGCL.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 12,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.3 CLOSING; EFFECTIVE TIME",
  "text": "The closing of the transactions contemplated by this Agreement (the “Closing”) shall take place at the offices of [PARENT’S COUNSEL, ADDRESS], at 10:00 a.m. local time on a date to be designated by Parent (the “Closing Date”), which shall be no later than the fifth Business Day after the satisfaction or waiver of the last to be satisfied or waived of the conditions set forth in Articles 5 and 6 (other than those conditions that by their nature cannot be satisfied prior to the Closing, but subject to the satisfaction or waiver of those conditions at the Closing) or at such other time and date as may be mutually agreed by Parent and the Company.\nSubject to the provisions of this Agreement, a certificate of merger satisfying the applicable requirements of the DGCL (the “Certificate of Merger”) shall be duly executed by the Company and, as soon as practicable following the Closing, filed with the Secretary of State of the State of Delaware (the “Secretary of State”). The Merger shall become effective upon the later of: (a) the date and time of the filing of the Certificate of Merger with the Secretary of State, or (b) such later date and time as may be specified in the Certificate of Merger as agreed to by the Parties.\nThe date and time the Merger becomes effective is referred to in this Agreement as the “Effective Time.”",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 13,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.4 CERTIFICATE OF INCORPORATION AND BYLAWS; DIRECTORS AND OFFICERS",
  "text": "At the Effective Time:\n(a) the certificate of incorporation of the Company shall be amended to read in its entirety as set forth in Exhibit A;\n(b) the bylaws of the Company shall be amended and restated to conform to the bylaws of Merger Sub as in effect immediately prior to the Effective Time; and\n(c) the directors and officers of the Surviving Corporation immediately after the Effective Time shall be the respective individuals who are directors and officers of Merger Sub immediately prior to the Effective Time.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 17,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.5 CONVERSION OF SHARES.",
  "text": "(a) At the Effective Time, by virtue of the Merger and without any further action on the part of Parent, Merger Sub, the Company, or any stockholder of the Company:\nThe fraction of a share of Parent Common Stock specified in Section 1.5(a)(iii) (as such fraction may be adjusted in accordance with Section 1.5(b)) is referred to as the “Exchange Ratio.”",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 19,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.6 CLOSING OF THE COMPANY’S TRANSFER BOOKS",
  "text": "At the Effective Time: (a) all holders of shares of Company Common Stock that were outstanding immediately prior to the Effective Time shall cease to have any rights as stockholders of the Company other than the right to receive shares of Parent Common Stock (and cash in lieu of any fractional share of Parent Common Stock) as contemplated by Section 1.5 and any dividends or other distributions payable pursuant to Section 1.7(c); and (b) the stock transfer books of the Company shall be closed with respect to all shares of Company Common Stock outstanding immediately prior to the Effective Time.\nNo further transfer of any such shares of Company Common Stock shall be made on such stock transfer books after the Effective Time.\nIf, after the Effective Time, any shares of Company Common Stock are presented to the Exchange Agent or to the Surviving Corporation or Parent, such shares of Company Common Stock shall be cancelled and shall be exchanged as provided in Section 1.7.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 20,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.7 EXCHANGE OF CERTIFICATES.",
  "text": "(a) On or prior to the Closing Date, Parent shall select a bank or\ntrust company to act as exchange agent in the Merger (the “Exchange Agent”). Parent shall make available to the Exchange Agent (by instruction to Parent’s transfer agent) and cash amounts so deposited with the Exchange Agent are referred to collectively as the “Exchange Fund.”\n | (b) Exchange Agent shall mail to the record holders of Company Common Stock (i) a letter of transmittal in customary form and containing such provisions as Parent may reasonably specify (including a provision confirming that delivery shall be effected, and risk of loss and title shall pass, only upon proper delivery of the Company Stock Certificates to the Exchange Agent or, in the case of Book Entry Shares, upon adherence to the procedures set forth in the letter of transmittal), and (ii) instructions for use in effecting the surrender of such holder’s Company Stock Certificates and Book Entry Shares in exchange for certificates representing Parent Common Stock (or appropriate alternative arrangements if uncertificated shares of Parent Common Stock represented by a book entry will be issued). Exchange of any Book Entry Shares shall be effected in accordance with the Exchange Agent’s customary procedures with respect to securities represented by book entry. Upon surrender of a Company Stock Certificate or Book Entry Share to the Exchange Agent for exchange, together with a duly executed letter of transmittal and such other documents as may be reasonably required by the Exchange Agent or Parent, the holder of such Company Stock Certificate or Book Entry Share shall be entitled to receive in exchange therefor a certificate representing the number of whole shares of Parent Common Stock (or uncertificated shares of Parent Common Stock represented by a book entry) that such holder has the right to receive pursuant to the provisions of Section 1.5 (and cash in lieu of any fractional share of Parent Common Stock). The Company Stock Certificate or Book Entry Share so surrendered shall be canceled. Until surrendered as contemplated by this Section 1.7, each Company Stock Certificate or Book Entry Share shall be deemed, from and after the Effective Time, to represent only the right to receive shares of Parent Common Stock (and cash in lieu of any fractional share of Parent Common Stock) as contemplated by Section 1.5. If any Company Stock Certificate shall have been lost, stolen, or destroyed, Parent or the Exchange Agent may, in its discretion and as a condition precedent to the issuance of any certificate representing Parent Common Stock, require the owner of such lost, stolen, or destroyed Company Stock Certificate to provide an appropriate affidavit and to deliver a bond (in such sum as Parent or the Exchange Agent may reasonably direct) as indemnity against any claim that may be made against the Exchange Agent, Parent, or the Surviving Corporation with respect to such Company Stock Certificate. | As soon as reasonably practicable after the Effective Time, the\n | (c) | No dividends or other distributions declared or made with\n | respect to Parent Common Stock with a record date after the Effective Time shall be paid to the holder of any unsurrendered Company Stock Certificate or Book Entry Share with respect to the shares of Parent Common Stock that such holder has the right to receive in the Merger until such holder surrenders such Company Stock Certificate or Book Entry Shares in accordance with this Section 1.7 (at which time such holder shall be entitled, subject to the effect of applicable escheat law or similar Legal Requirement, to receive all such dividends and distributions, without interest).\n | (d) | Any portion of the Exchange Fund that remains undistributed\n | to holders of Company Stock Certificates or Book Entry Shares as of the date 180 days after the Effective Time shall be delivered to Parent upon demand, and any holders of Company Stock Certificates or Book Entry Shares who have not theretofore surrendered their Company Stock Certificates or Book Entry Shares in accordance with this Section 1.7 shall thereafter look only to Parent for satisfaction of their claims for Parent Common Stock, cash in lieu of fractional shares of Parent Common Stock, and any dividends or distributions with respect to Parent Common Stock, in each case without interest thereon.\n | (e) Corporation shall be entitled to deduct and withhold from any consideration payable or otherwise deliverable pursuant to this Agreement to any holder or former holder of Company Common Stock such amounts as may be required to be deducted or withheld therefrom under the Code or any provision of state, local, or foreign Tax law or under any other applicable Legal Requirement. To the extent such amounts are so deducted or withheld, such amounts shall be treated for all purposes under this Agreement as having been paid to the Person to whom such amounts would otherwise have been paid. | Each of the Exchange Agent, Parent, and the Surviving\n | (f) | Neither Parent nor the Surviving Corporation shall be liable to\n\nany holder or former holder of Company Common Stock or to any other Person with respect to any shares of Parent Common Stock (or dividends or distributions with respect thereto), or for any cash amounts, properly delivered to any public official pursuant to any applicable abandoned property law, escheat law, or similar Legal Requirement.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 24,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION", CONVERSION OF SHARES
  "subsection_name": "1.8 TAX CONSEQUENCES",
  "text": "For federal income tax purposes, the Merger is intended to constitute a reorganization within the meaning of Section 368(a) of the Code.\nThe parties to this Agreement hereby adopt this Agreement as a “plan of reorganization” within the meaning of Sections 1.368-2(g) and 1.368-3(a) of the United States Treasury Regulations.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 25,
  "section_name": "ARTICLE 1 DESCRIPTION OF TRANSACTION",
  "subsection_name": "1.9 FURTHER ACTION",
  "text": "If, at any time after the Effective Time, any further action is determined by Parent to be necessary or desirable to carry out the purposes of this Agreement or to vest the Surviving Corporation with full right, title, and possession of and to all rights and property of Merger Sub and the Company, the officers and directors of the Surviving Corporation and Parent shall be fully authorized (in the name of Merger Sub, in the name of the Company, and otherwise) to take such action.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 26,
  "section_name": null,
  "subsection_name": "REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "text": "The Company represents and warrants to Parent and Merger Sub as follows:",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 27,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.1 ORGANIZATION AND GOOD STANDING.",
  "text": " |  | (a) | The Company and each of its Subsidiaries are corporations or\n | --- | --- | ---\n | other entities duly organized, validly existing, and in good standing under the laws of their respective jurisdictions of incorporation or organization, with full corporate or other entity power and authority to conduct their respective businesses as now being conducted, to own or use the respective properties and assets that they purport to own or use, and to perform all their respective obligations under each of the Company Contracts. The Company and each of its Subsidiaries are duly qualified to do business as foreign corporations or other entities and are in good standing under the laws of each state or other jurisdiction in which either the ownership or use of the properties owned or used by them, or the nature of the activities conducted by it, requires such qualification, except where the failure to be so qualified, individually or in the aggregate, has not had and could not reasonably be expected to have a Company Material Adverse Effect.\n |  Company and each of its Subsidiaries and sets forth as to each the type of entity, its jurisdiction of organization and, except in the case of the Company, its stockholders or other equity holders. The Company has delivered to Parent copies of the certificate or articles of incorporation, by-laws, and other organizational documents (collectively, “Organizational Documents”) of the Company and each of its Subsidiaries, as currently in | (b) | Part 2.1(b) of the Company Disclosure Schedule lists the\n | 2.2 AUTHORITY; NO CONFLICT.\n |  | (a) | The Company has all necessary corporate power and authority\n\nto execute and deliver this Agreement and the other agreements referred to in this Agreement to which it is or will be a party, and to perform its obligations hereunder and thereunder.\nThe execution and delivery of this Agreement by the Company and the consummation by the Company of the Merger and the other transactions contemplated hereby and thereby (collectively, and including the execution, delivery, and performance by certain of the Company’s stockholders of the Stockholder Voting Agreements, the “Contemplated Transactions”) have been duly and validly authorized by all necessary corporate action and no other corporate proceedings on the part of the Company are necessary to authorize this Agreement or to consummate the Contemplated Transactions (other than, with respect to the Merger, the adoption of this Agreement by the holders of a majority of the then outstanding shares of Company Common Stock (the “Required Stockholder Vote”)).\nThe Company Board has unanimously approved this Agreement, declared it to be advisable, and resolved to recommend to the stockholders of the Company that they vote in favor of the adoption of this Agreement in accordance with the DGCL.\nThis Agreement has been duly and validly executed and delivered by the Company and constitutes the legal, valid, and binding obligation of the Company, enforceable against the Company in accordance with its terms, except as such enforcement may be limited by applicable bankruptcy, insolvency, moratorium, or other similar Legal Requirement affecting the enforcement of creditors’ rights generally, and subject to general principles of equity (whether considered in a proceeding whether in equity or at law).\nSchedule, neither the execution and delivery of this Agreement nor the consummation of any of the Contemplated Transactions do or will, directly or indirectly (with or without notice or lapse of time or both):\n(i) contravene, conflict with, or result in a violation of (A) any provision of the Organizational Documents of the Company or any of its Subsidiaries or\n(ii) contravene, conflict with, or result in a violation of, or give any Governmental Body or other Person the right to challenge any of the Contemplated Transactions or to exercise any remedy or obtain any relief under, any Legal Requirement or any Order to which the Company or any of its Subsidiaries, or any of the assets owned or used by any of the Company or any of its Subsidiaries, is or may be subject;\n(iii) contravene, conflict with, or result in a violation of any of the terms or requirements of, or give any Governmental Body the right to revoke, withdraw, suspend, cancel, terminate, or modify, any Governmental Authorization that is held by the Company or any of its Subsidiaries, or that otherwise relates to the business of, or any of the assets owned or used by, the Company or any of its Subsidiaries;\n(iv) cause the Company or any of its Subsidiaries to become subject to, or to become liable for the payment of, any Tax;\n(v) cause any of the assets owned by the Company or any of its Subsidiaries to be reassessed or revalued by any Taxing Authority or other Governmental Body;\n(vi) contravene, conflict with, or result in a violation or breach of any provision of, result in the loss of any benefit or the imposition of any additional payment or other liability under, give any Person the right to declare a default or exercise any remedy under, to accelerate the maturity or performance of, or to cancel, terminate, redeem, or modify any Company Contract, exercise any change in control or similar put rights with respect to, or to require a greater rate of interest on, any debt obligations of the Company; or\n(vii) result in the imposition or creation of any Encumbrance upon or with respect to any of the assets owned or used by the Company or any of its Subsidiaries, except, in the case of clauses (ii), (iii), (iv), (v), (vi), and (vii), for any such conflicts, violations, breaches, defaults, or other occurrences that, individually or in the aggregate, have not had and could not reasonably be expected to have a Company Material Adverse Effect.\n(c) The execution and delivery of this Agreement by the Company\ndo not, and the performance of this Agreement and the consummation of the Contemplated Transactions by the Company will not, require any Consent of, or filing with or notification to, any Person, except (i) for (A) applicable requirements, if any, of the Exchange Act, the Securities Act and state securities or “blue sky” Legal Requirements (“Blue Sky Laws”), (B) the pre-merger notification requirements of the HSR Act, (C) filing of a certificate of merger as required by the DGCL and (D) filings required by the non- United States competition, antitrust, and investment laws set forth in Part 2.2(c) of the Company Disclosure Schedule and (ii) where failure to obtain such Consents, or to make such filings or notifications, individually or in the aggregate, have not had and could not reasonably be expected to have a Company Material Adverse Effect.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 39,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.3 AUTHORIZED CAPITAL.",
  "text": " | (a) | The authorized capital stock of the Company consists of\n | shares of Company Common Stock and | shares of Company Preferred Stock.\n | (b) | As of the date hereof: (i) shares of Company Common Stock are issued and\n\noutstanding, all of which have been duly authorized and validly issued, and are fully paid and nonassessable, (ii) shares of Company Common Stock are reserved for\nissuance upon the exercise of outstanding stock options granted pursuant to the Company’s employee stock plans (the “Company Stock Options”), (iii) shares of Company Common Stock are reserved for\nissuance upon exercise of outstanding warrants of the Company, (iv) shares of Company Common Stock are held in the\ntreasury of the Company, (v) shares of Company Common Stock are reserved for\nissuance pursuant to Company Stock Options not yet granted or other Company Benefit Plans, and (vi) shares of Company Preferred Stock are reserved for\nissuance upon exercise of the rights issued pursuant to the rights agreement dated between the Company and (the “Company Rights Agreement”).\n(c) No shares of Company Preferred Stock are outstanding.\nThere are no bonds, debentures, notes, or other indebtedness or, except for the Company Common Stock, other securities of the Company having the right to vote (or convertible into, or exchangeable for, securities having the right to vote) on any matters on which stockholders of the Company may vote.\n(d) Part 2.3(d) of the Company Disclosure Schedule sets forth, as of the date hereof, a complete and correct list of each option (including each Company Stock Option), stock appreciation right, warrant or other right, award of restricted shares of Company Common Stock, Contract, arrangement, or commitment of any character relating to the issued or unissued capital stock of the Company or any of its Subsidiaries, or obligating the Company or any of its Subsidiaries to issue, grant, or sell any shares of capital stock of, or other equity interests in, or securities convertible into equity interests in, the Company or any of its Subsidiaries (each, a “Company Stock-Based Right”), setting forth with respect to each such Company Stock-Based Right: the name of the holder thereof; the Plan under which such Company Stock-Based Right was granted, if any; the number of shares of Company Common Stock subject to such Company Stock-Based Right; the per-share price at which such Company Stock-Based Right may be exercised or the shares of Company Common Stock subject to such Company Stock-Based Right were sold or issued; the grant and expiration dates; and the terms of vesting, including whether (and to what extent) the vesting will be accelerated in any way by this Agreement or by termination of employment or change in position following consummation of the Merger.\nEach outstanding Company Stock-Based Right was duly authorized by all requisite corporate action on a date no later than the grant date and has an exercise price or price at which shares were originally issued or sold, to the extent applicable, at least equal to the fair market value of a share of Company Common Stock on the grant date.\n(e) All shares of Company Common Stock subject to issuance as described above will, upon issuance on the terms and conditions specified in the instruments pursuant to which they are issuable, be duly authorized, validly issued, fully paid, and nonassessable.\nExcept as set forth in Part 2.3(e) of the Company Disclosure Schedule, neither the Company nor any of its Subsidiaries has any Contract or other obligation to repurchase, redeem, or otherwise acquire any shares of Company Common Stock or any capital stock of any of the Company’s Subsidiaries, or make any investment (in the form of a loan, capital contribution, or otherwise) in any of the Company’s Subsidiaries or any other Person.\nNone of the outstanding equity securities or other securities of the Company or any of its Subsidiaries was issued in violation of the Securities Act or any other Legal Requirement.\nNeither the Company nor any of its Subsidiaries owns, or has any Contract or other obligation to acquire, any equity securities or other securities of any Person (other than Subsidiaries of the Company) or any direct or indirect equity or ownership interest in any other business.\nNeither the Company nor any of its Subsidiaries is or has ever been a general partner of any general or limited partnership.\n(f) Each outstanding share of capital stock of each of the\nCompany’s Subsidiaries is duly authorized, validly issued, fully paid, and nonassessable and each such share owned by the Company or any of its Subsidiaries is free and clear of all Encumbrances.\n2.4 SEC REPORTS.\nand documents required to be filed by it with the SEC since [•] (the “Applicable Date”). Part 2.4 of the Company Disclosure Schedule lists and, except to the extent available in full without redaction on the SEC’s website through the Electronic Data Gathering, Analysis and Retrieval System (“EDGAR”) two days prior to the date of this Agreement, the Company has delivered to Parent copies in the form filed with the SEC (including the full text of any document filed subject to a request for confidential treatment) of:\n(i) all forms, reports, registration statements, and other documents filed by the Company with the SEC since the Applicable Date (such forms, reports, registration statements, and other documents, whether or not available through EDGAR, are collectively referred to herein as the “Company SEC Reports”);\n(ii) all certifications and statements required by Rules 13a-14 and 15d-14 under the Exchange Act and Sections 302 and 906 of the Sarbanes-Oxley Act of 2002 (the “SOX”), and the rules and regulations of the SEC promulgated thereunder (collectively, the “Certifications”); and\n(iii) all comment letters received by the Company from the Staff of the SEC since the Applicable Date and all responses to such comment letters by or on behalf of the Company and all other correspondence since the Applicable Date between the SEC and the Company and its Subsidiaries.\nTo the Knowledge of the Company, except as disclosed in the Company SEC Reports, each director and officer (as defined in Rule 16a-1(f) under the Exchange Act) of the Company has filed with the SEC on a timely basis all statements required by Section 16(a) of the Exchange Act and the rules and regulations thereunder since the Applicable Date.\nNo subsidiary of the Company is, or since the Applicable Date has been, required to file any form, report, registration statement, or other document with the SEC. As used in this Section 2.4, the term “file” shall be broadly construed to include any manner in which a document or information is filed, furnished, transmitted, supplied, or otherwise made available to the SEC.\n(b) Each of the Company SEC Reports and the Certifications (i) as of the date of the filing thereof, complied with the requirements of the Securities Act, the Exchange Act, and the SOX, as the case may be, including in each case the rules and regulations thereunder, and (ii) as of its filing date (or, if amended or superseded by a subsequent filing prior to the date hereof, on the date of such filing) did not contain any untrue statement of a material fact or omit to state a material fact required to be stated therein or necessary in order to make the statements made therein, in the light of the circumstances under which they were made, not misleading.\n(c) The Company and its Subsidiaries have implemented and\nmaintain disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act), and such controls and procedures are effective to ensure that (i) all information required to be disclosed by the Company in the reports that it files under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms, and (ii) all such information is accumulated and communicated to the Company’s management, including its chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosure.\n | (d) compliance with (i) the applicable listing and corporate governance rules and regulations of the NYSE, and (ii) the applicable provisions of the SOX. The Company has delivered to Parent complete and correct copies of all correspondence between the Nasdaq and the Company and its Subsidiaries since the Applicable Date. | The Company is, and since the Applicable Date has been, in\n | (e) | Since the Applicable Date, neither the Company nor any of its\n | Subsidiaries or, to the Knowledge of the Company, any director, officer, employee, auditor, accountant, or representative of the Company or any of its Subsidiaries has received or has otherwise had or obtained Knowledge of any complaint, allegation, assertion, or claim, whether written or oral, regarding the accounting or auditing practices, procedures, methodologies, or methods of the Company or any of its Subsidiaries or their internal control over financial reporting, including any complaint, allegation, assertion, or claim that the Company or any of its Subsidiaries has engaged in questionable accounting or auditing practices.\n | (f) | The Company and its Subsidiaries have implemented and\n\nmaintain a system of internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) sufficient to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP, including, that:\n(i) transactions are executed in accordance with management’s general or specific authorizations;\n(ii) transactions are recorded as necessary to permit preparation of financial statements in conformity with GAAP and to maintain asset accountability;\n(iii) access to assets is permitted only in accordance with management’s general or specific authorization; and\n(iv) the recorded accountability for assets is compared with the existing assets at reasonable intervals and appropriate action is taken with respect to any differences.\n | (g) |  | Except as set forth in Part 2.4(g) of the Company’s Disclosure\n | --- | --- | ---\n | Schedule, since :\n | (i) there have not been any changes in the Company’s and its Subsidiaries’ internal controls over financial reporting that have materially affected, or are\n\nreasonably likely to materially affect, the Company’s and its Subsidiaries’ internal controls over financial reporting;\nPart 2.4(g) of the Company Disclosure Schedule lists, and the Company has delivered to Parent copies of, all reports and other documents concerning internal control filed with the SEC or delivered to the Company by its auditors since the Applicable Date.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 65,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.3 AUTHORIZED CAPITAL. > 2.5 FINANCIAL STATEMENTS.",
  "text": " | (a) notes thereto) contained or incorporated by reference in the Company SEC Reports complied with the rules and regulations of the SEC as of the date of the filing of such reports, was prepared in accordance with GAAP, and fairly presents the financial condition and the results of operations, changes in stockholders’ equity, and cash flow of the Company and its Subsidiaries as of the respective dates of and for the periods referred to in such financial statements, subject, in the case of interim financial statements, to (i) the omission of notes to the extent permitted by Regulation S-X (but only if, in the case of interim financial statements included in the Company SEC Reports since the Company’s most recent annual report on Form 10-K, such notes would not differ materially from the notes to the financial statements included in such annual report) and (ii) normal, recurring year-end adjustments (but only if the effect of such adjustments would not, individually or in the aggregate, be material). The consolidated balance sheet included in the Company’s most recent Annual Report on Form 10-K is referred to herein as the “Company Balance Sheet.” The financial statements referred to in this Section 2.5 reflect the consistent application of such accounting principles throughout the periods involved, except as disclosed in the notes to such financial statements. No financial statements of any Person other than the Subsidiaries of the Company are, or, since the Applicable Date have been, required by GAAP to be included in the consolidated financial statements of the Company. | Each of the financial statements (including, in each case, any\n | (b) | Part 2.5(b) of the Company Disclosure Schedule lists, and the\n | Company has delivered to Parent complete and correct copies of, the documents creating or governing all of the Company’s Off-Balance Sheet Arrangements.\n | (c) | Part 2.5(c) of the Company Disclosure Schedule contains a\n\ndescription of all nonaudit services performed by the Company’s auditors for the Company and its Subsidiaries since the beginning of the immediately preceding fiscal year of the Company and the fees paid for such services.\nAll such nonaudit services have been approved as required by Section 202 of the SOX.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 67,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.3 AUTHORIZED CAPITAL. > 2.6 NO UNDISCLOSED LIABILITIES",
  "text": "Except as set forth in Part 2.6 of the Company Disclosure Schedule, the Company and its Subsidiaries have no liabilities or obligations of any nature (whether absolute, accrued, contingent, determined, determinable, choate, inchoate, or otherwise), except for (a) liabilities or obligations reflected or reserved against in the Company Balance Sheet, or (b) current liabilities incurred in the ordinary course of business, consistent with past practice, since the date of the Company Balance Sheet that, individually or in the aggregate, are not material.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 68,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.3 AUTHORIZED CAPITAL. > 2.7 ABSENCE OF CERTAIN CHANGES AND EVENTS",
  "text": "Except as set forth in Part 2.7 of the Company Disclosure Schedule, since the date of the Company Balance Sheet, (a) the Company and its Subsidiaries have conducted their businesses only in the ordinary course of business consistent with past practice, and (b) there has not been: (i) any Company Material Adverse Effect, and no event has occurred or circumstance exists that may result in a Company Material Adverse Effect; (ii) any action or event of the type that would have required the consent of Parent under Section 4.1; or (iii) any material loss, damage, or destruction to, or any material interruption in the use of, any of the assets of any of the Company and its Subsidiaries (whether or not covered by insurance).",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 69,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.3 AUTHORIZED CAPITAL. > 2.8 INTELLECTUAL PROPERTY; PRIVACY.",
  "text": " | (a) complete and correct list of all U.S., state and foreign: (i) Patents owned by the Company or any of its Subsidiaries, (ii) Registered Trademarks and material unregistered Trademarks owned by the Company or any of its Subsidiaries, (iii) Registered Copyrights and material unregistered Copyrights owned by the Company or any of its Subsidiaries and (iv) for each of the foregoing, any actions, annuities, maintenance fees, or proceedings that must be paid or undertaken within the first ninety (90) days after the Closing Date in order to preserve, perfect, or maintain such Intellectual Property. | Part 2.8(a) of the Company Disclosure Schedule contains a\n | (b) | Except as set forth in Part 2.8(b) of the Company Disclosure\n | Schedule, the Company and its Subsidiaries collectively own all right, title, and interest in, or have the valid right to use, all of the Company IP, free and clear of all Encumbrances, and there are no obligations or covenants to, or restrictions from any other Persons affecting the use, enforcement, transfer, or licensing of the Owned Company IP by the Company and its Subsidiaries.\n | (c) | The Company and its Subsidiaries are the sole and exclusive\n | beneficial owners, and, with respect to applications and registrations, record owners, of all the Owned Company IP.\n | (d) | The Owned Company IP and Licensed Company IP constitute\n | all the Intellectual Property necessary to conduct the businesses of the Company and its Subsidiaries as currently conducted or as proposed to be conducted.\n | (e) | The Owned Company IP and, to the Knowledge of the\n | Company, Licensed Company IP, are valid, subsisting, and enforceable.\n | (f) | No Owned Company IP or Licensed Company IP is being\n | licensed, enforced, or otherwise used in a manner that would result in the abandonment, cancellation, or unenforceability of such Intellectual Property.\n | (g) and the conduct of their respective businesses, does not infringe, misappropriate, or otherwise violate any rights of any person, and no proceeding is pending or, to the Knowledge of the Company, has been threatened or asserted against the Company and its Subsidiaries with regard to the ownership, use, infringement, misappropriation, violation, validity, or enforceability of any Company IP. To the Knowledge of the Company, there is no valid basis for any such claim. | Use by the Company and its Subsidiaries of any Company IP,\n | (h) | Neither the Company nor any of its Subsidiaries has infringed,\n | misappropriated, or otherwise violated any Intellectual Property of any Third Party.\n | (i) misappropriating, or otherwise violating any rights of the Company or any of its Subsidiaries in or to any Company IP. No Proceeding is pending or has been threatened or asserted by the Company or any of its Subsidiaries against any person with regard to the ownership, use, infringement, misappropriation, violation, validity, or enforceability of any | To the Knowledge of the Company, no Person is infringing,\n | (j) actions to protect the confidentiality of their Trade Secrets and other confidential information. Each person presently or previously employed by the Company or any of its Subsidiaries (including independent contractors and consultants, if any) who has or had access to confidential or proprietary information or any Trade Secret has executed a confidentiality and nondisclosure agreement. | The Company and its Subsidiaries have taken reasonable\n | (k) | The consummation of the Contemplated Transactions, and\n\ncompliance by the Company with the provisions of this Agreement, will not result in the termination, cancellation, loss, or impairment of, nor require the payment of additional amounts or the Consent of any Person in respect of, or result in the creation of any Encumbrance in or upon, any Company IP.\nThe Company and its Subsidiaries\n(i) have good, valid and, in the case of real property, marketable title to, or valid leasehold or sublease interests or other comparable Contract rights in or relating to, all of the real property and other tangible assets used in or necessary for the conduct of their business as currently conducted and as proposed to be conducted, including good and valid title to all real property and other tangible assets reflected in the latest audited financial statements included in the Company SEC Reports as being owned by the Company and its Subsidiaries or acquired after the date thereof (other than property sold or otherwise disposed of in the ordinary course of business since the date thereof), free and clear of all Encumbrances except (A) Encumbrances for Taxes not yet due and payable, that are payable without penalty or that are being contested in good faith and for which adequate reserves have been established, (B) Encumbrances for assessments or other governmental charges or landlords’, carriers’, warehousemen’s, mechanics’, workers’ or similar Encumbrances incurred in the ordinary course of business consistent with past practice in connection with workers’ compensation, unemployment insurance, and other types of social security or to secure the performance of tenders, statutory obligations, surety and appeals bonds, bids, leases, government contracts, performance and return of money bonds, and similar obligations and (C) Encumbrances incurred in the ordinary course of business consistent with past practice that are not reasonably likely to adversely interfere in a material way with the use or affect the value of the property or assets encumbered thereby (collectively, “Permitted Liens”), and (ii) are collectively the lessee of all property material to the business of the Company and its Subsidiaries which is purported to be leased by the Company and its Subsidiaries and are in possession of such properties, and each lease for such property is valid and in full force and effect without material default thereunder by the lessee or the lessor.\nAll material items of equipment and other tangible assets owned by or leased to the Company and its Subsidiaries are sufficient for the uses to which they are being put, are in good and safe condition and repair (ordinary wear and tear excepted), and are sufficient for the conduct of the business of the Company and its Subsidiaries in the manner in which such business is currently being conducted and is proposed to be conducted.\nPart 2.9 of the Company Disclosure Schedule lists all material real property and any material interest in real property owned by Company or any of its Subsidiaries",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 73,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS",
  "text": "The Company and its Subsidiaries\n(b) The Company and its Subsidiaries have, within the time and in\nthe manner prescribed by law, paid all Taxes that are due and payable by them.\n(c) The Company and each of its Subsidiaries have complied with\nall applicable Legal Requirements relating to the payment and withholding of Taxes (including withholding and reporting requirements under the Code or Code Sections 1441 through 1464, 3401 through 3406, 6041 and 6049 and similar provisions under any other Legal Requirements ) and have, within the times and in the manner prescribed by applicable Legal Requirements, withheld from employee wages and paid over to proper Governmental Bodies all amounts required to be so withheld and paid.\n(d) Except as set forth in Part 2.10(d) of the Company Disclosure\nSchedule, no Tax Return of the Company or any of its Subsidiaries is under audit or examination by any Taxing Authority, and no written or unwritten notice of such an audit or examination has been received by the Company or any of its Subsidiaries and, the Company has no Knowledge of any threatened audits, investigations, or claims for or relating to Taxes, and there are no matters under discussion with any Taxing Authority with respect to Taxes.\nExcept as set forth in Part 2.10(d) of the Company Disclosure Schedule, no issues relating to Taxes were raised in writing by the relevant Taxing Authority during any presently pending audit or examination, and no issues relating to Taxes were raised in writing by the relevant Taxing Authority in any completed audit or examination that can reasonably be expected to recur in a later taxable period.\nPart 2.10(d) of the Company Disclosure Schedule lists, and the Company has delivered to Parent copies of, all examiner’s or auditor’s reports, notices of proposed adjustments, or similar commissions received by the Company or any of its Subsidiaries from any Taxing Authority since The U.S. income tax returns of the Company and its Subsidiaries consolidated in such returns have been examined by and settled with the Internal Revenue Service (the “IRS”) for all years, or all years are otherwise closed, through the taxable year ended (e) The charges, accruals, and reserves with respect to Taxes on the respective books of the Company and each of its Subsidiaries are adequate to pay all Taxes not yet due and payable and have been determined in accordance with GAAP.\nNo differences exist between the amounts of the book basis and the Tax basis of assets (net of liabilities) that are not accounted for on any accrual on the books of the Company and its Subsidiaries for federal income tax purposes.\nThere exists no proposed assessment of Taxes against the Company or any of its Subsidiaries except as disclosed in Part 2.10(e) of the Company Disclosure Schedule.\n(f) No Encumbrances for Taxes exist with respect to any assets or properties of the Company or any of its Subsidiaries, except for statutory liens for Taxes not yet due.\n(g) Part 2.10(g) of the Company Disclosure Schedule lists, and the Company has delivered to Parent copies of, any Tax-sharing agreement, Tax-allocation agreement, Tax-indemnity obligation, or similar written or unwritten agreement, arrangement, understanding, or practice with respect to Taxes (including any advance pricing agreement, closing agreement, or other agreement relating to Taxes with any Taxing Authority) to which the Company or any of its Subsidiaries is a party or by which the Company or any of its Subsidiaries is bound.\n(h) Neither the Company nor any of its Subsidiaries has requested any extension of time within which to file any Tax Return, which Tax Return has not since been filed.\n(i) Neither the Company nor any of its Subsidiaries has executed any outstanding waivers or comparable consents regarding the application of the statute of limitations with respect to any Taxes or Tax Returns.\n(j) No power of attorney currently in force has been granted by the Company or any of its Subsidiaries concerning any Taxes or Tax Return.\n(k) Neither the Company nor any of its Subsidiaries has received or been the subject of a Tax Ruling or a request for Tax Ruling.\nNeither the Company nor any of its Subsidiaries has entered into a Closing Agreement with any Governmental Body that would have a continuing effect after the Closing Date.\n“Tax Ruling” means a written ruling of a Governmental Body relating to Taxes.\n“Closing Agreement” means a written and legally binding agreement with a Governmental Body relating to Taxes.\n(l) Part 2.10(l) of the Company Disclosure Schedule lists, and the Company has made available to Parent, complete and correct copies of all Tax Returns, and any amendments thereto, filed by or on behalf of, or which include, the Company or any of its Subsidiaries, for all taxable periods that have ended.\n(m) Part 2.10(m) of the Company Disclosure Schedule lists, and Company has provided to Parent complete and correct copies of, all memoranda and opinions of counsel, whether inside or outside counsel, and all memoranda and opinions of accountants or other tax advisors, which have been received by the Company or any of its Subsidiaries with respect to Taxes.\n(n) Neither the Company nor any of its Subsidiaries is required to include in income any adjustment pursuant to Section 481 of the Code by reason of a voluntary change in accounting method initiated by the Company or any of its Subsidiaries, and the IRS has not proposed any such change in accounting method.\n(o) As of, the Company and its Subsidiaries had federal and state net operating loss carryovers available to offset income, the amounts of which net operating loss carryovers and the dates on which they arose, are set forth in Part 2.10(o) of the Company Disclosure Schedule.\nNeither the Company nor any of its Subsidiaries has undergone an ownership change (within the meaning of Section 382(g)(1) of the Code) since (p) As of, the Company and its Subsidiaries had Tax credit carryovers available to offset future Tax liability of The amount of the Tax credit carryovers, and the nature of those Tax credits and years in which they arose, for the Company and each of its Subsidiaries are set forth in Part 2.10(p) of the Company Disclosure Schedule.\n(q) No election under Section 338 of the Code has been made by or with respect to the Company or any of its Subsidiaries or any of their respective assets or properties.\n(r) Neither the Company nor any of its Subsidiaries has engaged in any transactions with Affiliates that would require the recognition of income by the Company or any of its Subsidiaries with respect to such transaction for any period ending on or after the Closing Date.\n(s) Except as set forth in Part 2.10(s) of the Company’s Disclosure\nSchedule, no transfer Taxes or other similar Taxes will be imposed due to the Merger or any other Contemplated Transaction.\n |  | (t) | The disallowance of a deduction under Section 162(m) of the\n | --- | --- | ---\n | Code for employee remuneration will not apply to any amount paid or payable by the Company or any of its Subsidiaries under any Company Contract, Company Benefit Plan, program, arrangement, or understanding currently in effect.\n |  | (u) | Neither the Company nor any of its Subsidiaries is a party to\n | any Contract that could result separately or in the aggregate, in the payment of an “excess parachute payment” within the meaning of Section 280G of the Code.\n |  | (v) | Neither the Company nor any of its Subsidiaries has taken any\n | action, nor to the Knowledge of the Company is there any fact or circumstance, that could reasonably be expected to prevent the Merger from qualifying as a reorganization within the meaning of Section 368(a) of the Code.\n |  | (w) | No claim has ever been made by a Governmental Body in a\n | jurisdiction where the Company or any of its Subsidiaries does not file Tax Returns that such Entity is or may be subject to taxation by that jurisdiction.\n |  | (x) | Neither the Company nor any of its Subsidiaries (A) has been a\n | member of an “affiliated group” within the meaning of Code Section 1504(a) filing a consolidated federal income Tax Return (other than a group the common parent of which was the Company) or (B) has any liability for the Taxes of any Person (other than the Company and its Subsidiaries) under U.S. Treasury Regulations Section 1.1502-6 (or any similar provision of state, local, or foreign law), as a transferee or successor, by Contract, or otherwise.\n |  | (y) | Neither the Company nor any of its Subsidiaries will be\n | required to include any item of income in, or exclude any item of deduction from, taxable income for any taxable period (or portion thereof) ending after the Closing Date as a result of any (x) installment sale or open transaction disposition made on or prior to the Closing Date, or (y) prepaid amount received on or prior to the Closing Date.\n |  | (z) | Neither the Company nor any of its Subsidiaries has\n | distributed stock of another Person, or has had its stock distributed by another Person, in a transaction that was purported or intended to be governed in whole or in part by Code Sections 355 or 361.\n |  | (aa) | Part 2.10(aa) of the Company Disclosure Schedule lists all Tax\n\ngrants, abatements, or incentives granted or made available by any Governmental Body for the benefit of the Company and its Subsidiaries, and, to the Knowledge of the Company, any conditions relating to the continued availability of such Tax grants, abatements, or incentives to the Company and its Subsidiaries, or, to the Knowledge of the Company, events or circumstances which could impair the ability of Parent or the Company and its Subsidiaries to utilize such Tax grants, abatements, or incentives following the Closing Date.\n2.11 EMPLOYEE BENEFITS.\n | (a) | As used in this Agreement: “Controlled Group Liability”\n | means any and all liabilities under (i) Title IV of ERISA, (ii) Section 302 of ERISA, (iii) Sections 412 and 4971 of the Code, (iv) the continuation coverage requirements of Section 601 et seq. of ERISA and Section 4980B of the Code, and (v) corresponding or similar provisions of foreign laws or regulations, other than such liabilities that arise solely out of, or relate solely to, the Company Benefit Plans; “ERISA” means the Employee Retirement Income Security Act of 1974, as amended, and the regulations thereunder; and “ERISA Affiliate” means, with respect to any entity, trade, or business, any other entity, trade, or business that is a member of a group described in Section 414(b), (c), (m) or (o) of the Code or Section 4001(b)(1) of ERISA that includes the first entity, trade, or business, or that is a member of the same “controlled group” as the first entity, trade, or business pursuant to Section 4001(a)(14) of ERISA.\n | (b) | Except as required under this Agreement, since ,\n\nthere has not been:\n(i) any adoption or material amendment by the Company or any of its Subsidiaries of any collective bargaining agreement or any bonus, pension, profit sharing, deferred compensation, incentive compensation, stock ownership, stock purchase, stock option, restricted stock, phantom stock, stock appreciation right, retirement, vacation, severance, disability, death benefit, hospitalization, medical, worker’s compensation, supplementary unemployment benefits, or other plan, arrangement, or understanding (whether or not legally binding) or any employment agreement providing compensation or benefits to any current or former employee, officer, director, or independent contractor of the Company or any of its Subsidiaries or any beneficiary thereof or sponsored, entered into, maintained, or contributed to, as the case may be, by the Company or any of its Subsidiaries or their ERISA Affiliates or with respect to which the Company and its Subsidiaries or their ERISA Affiliates otherwise have any liabilities or obligations (collectively, “Company Benefit Plans”), or\n(ii) any adoption of, or amendment to, or change in employee participation or coverage under, any Company Benefit Plans which would materially increase the expense of maintaining such Company Benefit Plans above the level of the expense incurred in respect thereof for the fiscal year ended on\nWithout limiting the generality of the foregoing, the term “Company Benefit Plans” includes all employee welfare benefit plans within the meaning of Section 3(1) of ERISA, all employee pension benefit plans within the meaning of Section 3(2) of ERISA, and all other employee benefit, bonus, incentive, deferred compensation, stock purchase, stock option, severance, change of control, and fringe benefit plans, programs, or agreements.\nExcept as expressly contemplated hereby, neither the execution and delivery of this Agreement nor the consummation of the Contemplated Transactions will (either alone or in conjunction with any other event) result in, cause the accelerated vesting or delivery of, or increase the amount or value of, any payment or benefit to any current or former employee, officer, director, or independent contractor of the Company and its Subsidiaries and all Company Benefit Plans permit assumption by Parent upon consummation of the Contemplated Transactions without the Consent of any participant.\n | (c) | Part 2.11(c) of the Company Disclosure Schedule includes a\n | complete and correct list of all Company Benefit Plans.\n | (d) delivered to Parent a complete copy of: (i) each writing (or a written description of such Company Benefit Plan if not in writing) constituting a part of such Company Benefit Plan, including all plan documents (and amendments thereto), benefit schedules, trust agreements, insurance Contracts, administrator or service agreements, and other funding vehicles; (ii) the three most recent annual reports (Form 5500 Series) and accompanying schedule(s), if any; (iii) the current summary plan description and any material modifications thereto, if any; (iv) the three most recent annual financial reports and related accountant’s opinions, if any; (v) the three most recent actuarial reports, if any; (vi) any correspondence with the IRS, Department of Labor, or the PBGC regarding any Company Benefit Plan; (vii) any discrimination tests for each Company Benefit Plan for the three most recent Plan years; and (viii) the most recent determination letter from the IRS, if any. Except as specifically provided in the foregoing documents delivered to Parent, there are no amendments to any Company Benefit Plan or any new Company Benefit Plan that have been adopted or approved, nor has the Company undertaken to make any such amendments or adopt or approve any new Company Benefit Plan. | With respect to each Company Benefit Plan, the Company has\n | (e) each Company Benefit Plan that is intended to be a “qualified plan” within the meaning of Section 401(a) of the Code (“Qualified Company Benefit Plans”). The IRS has issued a currently effective determination letter (determined in accordance with Revenue Procedure 2007-44, or such future guidance issued by the IRS) with respect to each Qualified Company Benefit Plan that has not been revoked, and, to the Knowledge of the Company, there are no existing circumstances or any events that have occurred that could adversely affect the qualified status of any Qualified Company Benefit Plan or the related trust. No Company Benefit Plan is intended to meet the requirements of Section 501(c)(9) | Part 2.11(e) of the Company Disclosure Schedule identifies\n | (f) | All contributions required to be made to any Company Benefit\n | Plan by applicable Legal Requirements or by any plan document or other contractual undertaking, and all premiums due or payable with respect to insurance policies funding any Company Benefit Plan, for any period through the date hereof have been timely made or paid in full or (in accordance with the Code and ERISA), to the extent not required to be made or paid on or before the date hereof, have been fully reflected on the financial statements contained in the Company’s SEC Reports.\n | (g) | All Company Benefit Plans have complied and currently\n\ncomply, and have been administered, in form and operation, in all material respects in accordance with their terms and with all applicable legal requirements, including ERISA and the Code and, in the case of a Company Benefit Plan that is an employee pension benefit plan, the requirements of sections 401(a) and 501(a) of the Code, and no event has occurred that will or could cause any such Company Benefit Plan to fail to comply with such requirements and no notice has been issued by any Governmental Body questioning or challenging such compliance.\nThere is not now, nor do any circumstances exist that could give rise to, any requirement for the posting of security with respect to a Company Benefit Plan or the imposition of any Encumbrance on the assets of the Company under ERISA or the Code.\nNo prohibited transaction under section 4975 of the Code or section 406 of ERISA has occurred with respect to any Company Benefit Plan.\n | (h) | Each Plan that constitutes a \"group health plan\" (as defined in\n | Section 607(i) of ERISA or Code Section 4980B(g)(2)), including any plans of current and former affiliates which must be taken into account under Code Sections 4980B and 414(t) or Sections 601-608 of ERISA, has been operated in compliance with applicable Legal Requirements, including the continuation coverage requirements of Section 4980B of the Code and section 601 of ERISA and the portability and nondiscrimination requirements of Code Sections 9801 and 9802 and Sections 701-707 of ERISA, to the extent such requirements are applicable.\n | (i) | With respect to each Company Benefit Plan that is subject to\n\ntitle IV or Section 302 of ERISA or Section 412 or 4971 of the Code: (i) there does not exist any accumulated funding deficiency within the meaning of Section 412 of the Code or Section 302 of ERISA, whether or not waived; (ii) the fair market value of the assets of such Company Benefit Plan equals or exceeds the actuarial present value of all accrued benefits under the Company Benefit Plan (whether or not vested), on a termination basis;\n(iii) no reportable event within the meaning of Section 4043(c) of ERISA has occurred, and the consummation of the Contemplated Transactions will not result in the occurrence of any such reportable event; (iv) no event has occurred or circumstances exist that may constitute grounds under Section 4042 of ERISA for the termination of, or the appointment of a trustee to administer, any Company Benefit Plan; (v) no amendment has been made or is reasonably expected to be made, to any Company Benefit Plan that has required or could require the provision of security under Section 307 of ERISA or Section 401(a)(29) of the Code; and (vi) all premiums to the PBGC have been timely paid in full.\nAll liabilities in connection with the termination of any employee pension benefit plan that was sponsored, maintained, or contributed to by the Company or any of its Subsidiaries at any time within the past three years have been fully satisfied.\ncould result in, any Controlled Group Liability that would be a liability of the Company or any of its Subsidiaries following the Closing.\nWithout limiting the generality of the foregoing, none of the Company, any of its Subsidiaries, or any ERISA Affiliate of the Company or any of its Subsidiaries has engaged in any transaction described in Section 4069 or Section 4204 of ERISA or become subject to any liability under Sections 4062(e) 4063 or 4064 of ERISA.\n | (l) | Neither the Company nor any of its Subsidiaries has any\n | liability for life, health, medical, or other welfare benefits to former employees or beneficiaries or dependents thereof, except for health continuation coverage as required by Section 4980B of the Code or part 6 of title I of ERISA and at no expense to the Company or any of its Subsidiaries.\n | (m) | All Company Benefit Plans covering foreign employees of the\n | Company and its Subsidiaries comply with applicable Legal Requirements and are fully funded and/or book reserved to the extent applicable.\n | (n) | There are no pending or threatened claims (other than claims\n | for benefits in the ordinary course), lawsuits, or arbitrations which have been asserted or instituted against the Company Benefit Plans, any fiduciaries thereof with respect to their duties to the Company Benefit Plans, or the assets of any of the trusts under any of the Company Benefit Plans which could reasonably be expected to result in any material liability of the Company or any of its Subsidiaries to the PBGC, the Department of the Treasury, the Department of Labor, or any Multiemployer Plan.\n | (o) complete and correct list as of the date of this Agreement of all loans and advances made by the Company or any of its Subsidiaries to any employee, director, consultant, or independent contractor, other than routine travel and expense advances made to employees in the ordinary course of business. The Company and its Subsidiaries have not, since July 30, 2002, extended or maintained credit, arranged for the extension of credit, or renewed an extension of credit, in the form of a personal loan to or for any director or executive officer (or equivalent thereof) of the Company and no such loans extended or made prior thereto remain outstanding. Part 2.11(o) of the Company Disclosure Schedule identifies any extension of credit maintained by the Company and its Subsidiaries to which the second sentence of Section 13(k)(1) of the Exchange Act applies. | Part 2.11(o) of the Company Disclosure Schedule contains a\n | (p) | Each Company Benefit Plan that is a “nonqualified deferred\n | compensation plan” (within the meaning of Section 409A(d)(1) of the Code) has been operated in compliance with Section 409A of the Code, and the Treasury Regulations issued under Section 409A of the Code, and any subsequent guidance relating thereto, and no additional tax under Section 409A(a)(1)(B) of the Code has been or is reasonably expected to be incurred by a participant in any such Company Benefit Plan, and no employee of the Company or any of its Subsidiaries is entitled to any gross-up or otherwise entitled to indemnification by the Company and its Subsidiaries, for any violation of Section 409A of the Code.\n | (q) | Neither the Company nor any of its Subsidiaries has used the\n\nservices of workers provided by third-party contract labor suppliers, temporary employees, “leased employees” (as that term is defined in Section 414(n) of the Code), or individuals who have provided services as independent contactors, to an extent that would reasonably be expected to result in the disqualification of any of the Company Benefit Plans or the imposition of penalties or excise Taxes with respect to any of the Company Benefit Plans by the IRS, the Department of Labor, or the PBGC.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 97,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.12 COMPLIANCE WITH LEGAL REQUIREMENTS; GOVERNMENTAL AUTHORIZATIONS",
  "text": "The Company and its Subsidiaries are, and at all times since have been, in material compliance with each Legal Requirement that is or was applicable to any of them or to the conduct or operation of their business or the ownership or use of any of their assets.\nNo event has occurred or circumstance exists that (with or without notice or lapse of time or both) (a) may constitute or result in a material violation by the Company or any of its Subsidiaries of, or a material failure on the part of the Company or any of its Subsidiaries to comply with, any Legal Requirement, or (b) may give rise to any obligation on the part of the Company or any of its Subsidiaries to undertake, or to bear all or any portion of the cost of, any substantial remedial action of any nature.\nNeither the Company nor any of its Subsidiaries has received, at any time since, any notice or other communication (whether oral or written) from any Governmental Body or any other Person regarding (i) any actual, alleged, possible, or potential violation of, or failure to comply with, any Legal Requirement, or (ii) any actual, alleged, possible, or potential obligation on the part of the Company or any of its Subsidiaries to undertake, or to bear all or any portion of the cost of, any remedial action of any nature.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 98,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.13 ENVIRONMENTAL MATTERS.",
  "text": " | (a) | Except as set forth in Part 2.13(a) of the Company Disclosure\n | Schedule:\n | (i) the Company and its Subsidiaries have at all times complied in all material respects with, and are not currently in material violation of, any applicable Environmental Laws;\n\n(ii) the Company and its Subsidiaries have all permits, licenses, and approvals required under Environmental Laws to operate and conduct their respective businesses as currently operated and conducted;\n(iii) there is no Contamination of or at the Facilities (including soils, groundwater, surface water, buildings, or other structures);\n(iv) there was no Contamination of or at the Facilities prior to or during the period of time such properties were owned, leased, or operated by the Company and its Subsidiaries;\n(v) neither the Company nor any of its Subsidiaries is subject to liability for a Release of any Hazardous Substance or Contamination on the property of any third party;\n(vi) neither the Company nor any of its Subsidiaries has Released any Hazardous Substance into the environment;\n(vii) neither the Company nor any of its Subsidiaries has received any notice, demand, letter, claim, or request for information, and neither the Company nor any of its Subsidiaries is aware of any pending or threatened notice, demand, letter, claim, or request for information, alleging that the Company or any of its Subsidiaries may be in violation of, liable under, or have obligations under any Environmental Law;\n(viii) neither the Company nor any of its Subsidiaries is subject to any Orders or other arrangements with any Governmental Body or to any indemnity or other agreement with any third party relating to liability or obligation under any Environmental Law or relating to Hazardous Substances;\n(ix) there are no circumstances or conditions involving the Company or any of its Subsidiaries that could reasonably be expected to result in any claims, liability, obligations, investigations, costs, or restrictions on the ownership, use, or transfer of any property of the Company or any of its Subsidiaries pursuant to any Environmental Law;\n(x) none of the Facilities is listed in the National Priorities List or any other list, schedule, log, inventory, or record maintained by any Governmental Body with respect to sites from which there is or has been a Release of any Hazardous Substance or any Contamination;\n(xi) none of the Facilities is used, nor was ever used, (A) as a landfill, dump, or other disposal, storage, transfer, or handling area for Hazardous Substances, excepting, however, for the routine storage and use of Hazardous Substances from time to time in the ordinary course of business, in compliance with Environmental Laws and in compliance with good commercial practice; (B) for industrial, military, or manufacturing purposes; or (C) as a gasoline service station or a facility for selling, dispensing, storing, transferring, or handling petroleum or petroleum products;\n(xii) no underground or above ground storage tanks (whether or not currently in use), urea-formaldehyde materials, asbestos, asbestos-containing materials, polychlorinated biphenyls (“PCBs”), or nuclear fuels or wastes, located on or under any of the Facilities, and no underground tank previously located on these properties has been removed therefrom; and\n(xiii) there are no Liens against any of the Facilities arising under any Environmental Law.\n(b) As used in this Agreement: (i) “Environmental Law” means any foreign, federal, state, or local law, statute, rule, or regulation or the common law relating to the environment or occupational health and safety, including any statute, regulation, administrative decision, or order pertaining to (A) treatment, storage, disposal, generation, and transportation of industrial, toxic, infectious, biological, radioactive, or hazardous materials or substances or solid, medical, mixed, or hazardous waste, (B) air, water, and noise pollution,",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 112,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > (c) Part 2",
  "text": "13(c) of the Company Disclosure Schedule sets forth a complete and correct list of all documents (whether in hard copy or electronic form) that contain any environmental, human health and safety, or natural resources reports, investigations, or audits relating to the Facilities (whether conducted by or on behalf of the Company, any of its Subsidiaries, or a third party, and whether done at the initiative of the Company or any of its Subsidiaries or directed by a Governmental Body or other third party) which were issued or conducted during the past five years and of which the Company or any of its Subsidiaries has possession or to which the Company or any of its Subsidiaries has access.\nA complete and correct copy of each such document has been delivered to Parent.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 113,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.14 LEGAL PROCEEDINGS.",
  "text": "(a) Except as set forth in Part 2.14(a) of the Company Disclosure\nSchedule, there is no pending Legal Proceeding (i) that has been commenced by or against the Company or any of its Subsidiaries or that otherwise relates to or may affect the business of, or any of the assets owned or used by, the Company or any of its Subsidiaries, (ii) that challenges, or that may have the effect of preventing, delaying, making illegal, or otherwise interfering with, any of the Contemplated Transactions, or (iii) against any director or officer of the Company or any of its Subsidiaries pursuant to Section 8A or 20(b) of the Securities Act or Section 21(d) or 21C of the Exchange Act.\n |  | (b) | To the Knowledge of the Company, (i) no Legal Proceeding\n | --- | --- | ---\n | that if pending would be required to be disclosed under the preceding paragraph has been threatened, and (ii) no event has occurred or circumstance exists that may give rise to or serve as a basis for the commencement of any such Legal Proceeding.\n |  | (c) | There are no Orders outstanding against the Company or any\n | of its Subsidiaries that, individually or in the aggregate, are material to the Company or any of its Subsidiaries.\n | 2.15 CONTRACTS; NO DEFAULTS.\n |  | (a) | The Company has delivered to Parent copies of each Material\n\nContract, except to the extent any such agreement has been filed without redaction and with all schedules and exhibits prior to the date of this Agreement as an exhibit to a Company SEC Report that is publicly available on EDGAR.\nFor purposes of this Agreement, “Material Contract” means each Acquired Company Contract (including any amendment thereto):\n(i) described in paragraphs (b)(3), (b)(4), (b)(9), or (b)(10) of Item 601 of Regulation S-K;\n(ii) to which or with respect to which the Company or any of its Subsidiaries and any director, officer, or Affiliate of the Company or any of its Subsidiaries are parties or beneficiaries;\n(iii) evidencing, governing, or relating to indebtedness for borrowed money or creating any guaranty or suretyship obligation of the Company or any of its Subsidiaries;\n(iv) that in any way purports to restrict the business activity of the Company or any of its Subsidiaries or any of their Affiliates or to limit the freedom of the Company or any of its Subsidiaries or any of their Affiliates to engage in any line of business or to compete with any Person or in any geographic area or to hire or retain any Person;\n(v) relating to the employment of, or the performance of services by, any employee or consultant, or pursuant to which the Company or any of its Subsidiaries is or may become obligated to make any severance, termination, or similar payment to any current or former employee or director; or pursuant to which the Company or any of its Subsidiaries is or may become obligated to make any bonus or similar payment (other than payments constituting base salary) in excess of $ to any current or former employee, director, or consultant;\n(vi) (A) relating to the acquisition, transfer, development, sharing, or license of any Proprietary Rights (except for any Contract pursuant to which (I) any Proprietary Rights are licensed to the Company or any of its Subsidiaries under any third- party software license generally available to the public, or (II) any Proprietary Rights are licensed by any of the Acquired Companies to any Person on a nonexclusive basis); or (B) of the type referred to in Section 2.8(c);\n(vii) providing for indemnification of any officer, director, employee, or agent;\n(viii) (A) relating to the acquisition, issuance, voting, registration, sale, or transfer of any securities, (B) providing any Person with any preemptive right, right of participation, right of maintenance, or any similar right with respect to any securities, or (C) providing the Company or any of its Subsidiaries with any right of first refusal with respect to, or right to repurchase or redeem, any securities, except for Contracts evidencing Company Stock Options;\n(ix) constituting, incorporating, or relating to any warranty, indemnity, or similar obligation, except for standard product warranties substantially identical to the standard forms of end-user licenses previously delivered by the Company to Parent;\n(x) relating to any currency, interest rate, or other hedging activity;\n(xi) (A) imposing any confidentiality obligation on the Company or any of its Subsidiaries or any other Person, or (B) containing “standstill” or similar provisions;\n(xii) (A) to which any Governmental Body is a party or under which any Governmental Body has any rights or obligations, or (B) directly or indirectly benefiting any Governmental Body (including any subcontract or other Contract between the Company or any of its Subsidiaries and any contractor or subcontractor to any Governmental Body);\n(xiii) requiring that the Company or any of its Subsidiaries give any notice or provide any information to any Person prior to considering or accepting any Acquisition Proposal or similar proposal, or prior to entering into any discussions, agreement, arrangement, or understanding relating to any Acquisition Transaction or similar transaction;\n(xiv) contemplating or involving the payment or delivery of cash or other consideration in an amount or having a value in excess of $ in the aggregate, or contemplating or involving the performance of services having a value in excess of $ in the aggregate, which is not cancelable or terminable without penalty or payment with less than 90 days’ notice;\n(xv) that could reasonably be expected to have a material effect on the business, condition, capitalization, assets, liabilities, operations, or financial performance of the Company or any of its Subsidiaries or on any of the Contemplated Transactions; and\n(xvi) any other Contract, if a breach or termination of such Contract could reasonably be expected to have a Company Material Adverse Effect.\n |  | (b) |  | Each Material Contract is valid and in full force and effect,\n | --- | --- | --- | ---\n | and is enforceable in accordance with its terms.\n |  | (c) |  | Except as set forth in Part 2.15(c) of the Company Disclosure\n | Schedule:\n | (i) neither the Company nor any of its Subsidiaries has violated or breached in any material respect, or committed any material default under, any Material Contract; and, to the Knowledge of the Company, no other Person has violated or breached in any material respect, or committed any material default under, any Material Contract;\n\n(ii) to the Knowledge of the Company, no event has occurred, and no circumstance or condition exists, that (with or without notice or lapse of time) will or could reasonably be expected to (A) result in a violation or breach, in any material respect, of any of the provisions of any Material Contract, (B) give any Person the right to declare a default or exercise any remedy under any Material Contract, (C) give any Person the right to receive or require a material rebate, chargeback, penalty, or change in delivery schedule under any Material Contract, (D) give any Person the right to accelerate the maturity or performance of any Material Contract, (E) result in the disclosure, release, or delivery of any Company Source Code, or (F) give any Person the right to cancel, terminate, or modify in any material respect any Material Contract; and\n(iii) neither the Company nor any of its Subsidiaries has received any notice or other communication regarding any actual or possible material violation or breach of, or default under, any Material Contract.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 136,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.16 INSURANCE",
  "text": "The Company and its Subsidiaries are covered by valid and currently effective insurance policies issued in favor of the Company that are adequate and otherwise customary for companies of similar size and financial condition.\nAll such policies are in full force and effect, no misrepresentations were made in connection with the applications for such policies, all premiums due thereon have been paid, and the Company and its Subsidiaries have complied with the provisions of such policies.\nPart 2.16 of the Company Disclosure Schedule provides a description of any claims pending and any claims that have been asserted in the past three years with respect to such policies.\nNeither the Company nor any of its Subsidiaries has received any written notice from or on behalf of any insurance carrier issuing policies or binders relating to or covering the Company or any of its Subsidiaries that there will be a cancellation or nonrenewal of existing policies or binders, or that alteration of any equipment or any improvements to real estate occupied by or leased to or by the Company or any of its Subsidiaries, purchase of additional equipment, or material modification of any of the methods of doing business, will be required.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 137,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.17 LABOR AND EMPLOYMENT MATTERS",
  "text": "Except as disclosed in Part 2.17 of the Company Disclosure Schedules,\n(a) neither the Company nor any of its Subsidiaries is a party to, or bound by, any collective bargaining agreement, contract, or other agreement or understanding with a labor union or labor organization; (b) neither the Company nor any of its Subsidiaries is the subject of any Legal Proceeding asserting that the Company or any of its Subsidiaries has committed an unfair labor practice or seeking to compel it to bargain with any labor organization as to wages or conditions of employment or any other matter; (c) no strike, work stoppage, or other labor dispute involving the Company or any of its Subsidiaries is pending or, to the Knowledge of the Company, threatened; (d) no complaint, charge, or Legal Proceeding by or before any Governmental Body brought by or on behalf of any employee, prospective employee, former employee, retiree, labor organization, or other representative of its employees or relating to its employees or employment practices (including charges of unfair labor practices) or working conditions is pending or to the Knowledge of the Company, threatened against the Company or any of its Subsidiaries; (e) no grievance is pending or to the Knowledge of the Company, threatened against the Company or any of its Subsidiaries; (f) neither the Company nor any of its Subsidiaries is a party to, or otherwise bound by, any consent decree with, or citation by, any Governmental Body relating to employees or employment practices; (g) no labor organization or group of employees of the Company or any of its Subsidiaries has made a pending demand for recognition or certification, and there are no representation or certification proceedings or petitions seeking a representation proceeding presently pending or threatened to be brought or filed, with the National Labor Relations Board or any other labor relations tribunal or authority; (h) the Company and each of its Subsidiaries are in compliance\nwith all applicable Legal Requirements relating to the employees and the engagement of leased employees, consultants, and independent contractors, including all Legal Requirements regarding discrimination, harassment, affirmative action, terms and conditions of employment, wage and hour requirements (including the proper classification of, compensation paid to, and related withholding with respect to employees, leased employees, consultants, and independent contractors), leaves of absence, reasonable accommodation of disabilities, occupational health and safety requirements, workers’ compensation, and employment practices; and the WARN Act and any similar state statutes.\n(i) the Company and each of its Subsidiaries have complied with",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 141,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.18 INTERESTS OF OFFICERS AND DIRECTORS",
  "text": "None of the officers or directors of the Company or any of its Subsidiaries or any of their respective Affiliates (other than the Company and its Subsidiaries) has any interest in any property, real or personal, tangible or intangible, used in or pertaining to the business of the Company and its Subsidiaries, or in any supplier, distributor, or customer of the Company and its Subsidiaries, or any other relationship, Contract.\nor understanding with the Company and its Subsidiaries, except as disclosed in the Company SEC Reports filed prior to the date hereof and except for the normal rights of a stockholder and rights under the Company Benefit Plans and the Company Stock Options.\nThe name of each officer, director, and stockholder beneficially owning 5% or more of the Company’s Common Stock is set forth in Part 2.18 of the Company Disclosure Schedule.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 142,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.19 COMPLIANCE WITH U",
  "text": "None of the Company, any of its Subsidiaries, directors, officers, managers, or employees of the Company or any of its Subsidiaries, or, to the Knowledge of the Company, agents or other representatives of the Company or any of its Subsidiaries, has directly or indirectly in violation of any Legal Requirement (including the Foreign Corrupt Practices Act of 1977, as amended (the “FCPA”)) (a) made any contribution, gift, bribe, rebate, payoff, influence payment, kickback, or other payment to any Person, regardless of form, whether in money, property, or services (i) to obtain favorable treatment in securing business, (ii) to pay for favorable treatment for business secured, or (iii) to obtain special concessions or for special concessions already obtained, for or in respect of the Company or any of its Subsidiaries, or (b) established or maintained any fund or asset that has not been recorded in the books and records of the Company or any of its Subsidiaries for the purposes of taking any of the actions in clause (a) above.\nThe Company and each of its Subsidiaries and, to the Knowledge of the Company, their Affiliates have at all times since conducted their respective businesses in compliance with the FCPA (including the recordkeeping provisions of the FCPA) and all similar Legal Requirements, domestic and foreign, and the Company and each of its Subsidiaries have instituted and maintained policies, procedures, and controls designed to ensure continued compliance therewith and with all similar Legal Requirements, domestic and foreign).",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 143,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.20 RIGHTS PLAN; STATE ANTITAKEOVER STATUTES",
  "text": "The Company has amended the Company Rights Agreement to provide that (a) neither Parent nor Merger Sub nor any of their respective Affiliates shall be deemed to be an Acquiring Person (as such term is defined in the Company Rights Agreement), and such amendment does not so exclude any other Person, (b) neither a Distribution Date nor a Share Acquisition Date (as each such term is defined in the Company Rights Agreement) shall be deemed to have occurred, and the Rights will not detach from the Company Common Stock or become nonredeemable, as a result of the execution, delivery, or performance of this Agreement or the Stockholder Voting Agreements or the consummation of the Merger or the other Contemplated Transactions, and (c) the Rights shall terminate immediately prior to the Effective Time.\nThe Company has taken all appropriate actions so that the restrictions on business combinations contained in any applicable state statutes will not apply to Parent or Merger Sub or with respect to or as a result of the Contemplated Transactions.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 144,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.21 OPINION OF FINANCIAL ADVISOR",
  "text": "The Company Board has received the opinion of dated, to the effect that, as of such date, and based on the assumptions, qualifications, and limitations contained therein, the consideration to be received by the stockholders of the Company pursuant to the Merger is fair to such stockholders from a financial point of view.\nA copy of that opinion has been delivered to Parent.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 145,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.22 BROKERS",
  "text": "No broker, finder, investment banker, or other Person (other than) is or may be entitled to any brokerage, finder’s, or other fee or commission in connection with the Merger and the Contemplated Transactions based upon arrangements or authorizations made by or on behalf of the Company or any of its Subsidiaries.\nThe Company has heretofore furnished to Parent copies of all Company Contracts between the Company and pursuant to which such firm would or may be entitled to any payment relating to the Contemplated Transactions.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 146,
  "section_name": "ARTICLE 2 REPRESENTATIONS AND WARRANTIES OF THE COMPANY",
  "subsection_name": "2.9 PROPERTY; SUFFICIENCY OF ASSETS > 2.23 FULL DISCLOSURE.",
  "text": "(a) This Agreement (including the Company Disclosure Schedule) does not, and the certificate referred to in Section 5.3 will not (i) contain any representation, warranty, or information that is false or misleading with respect to any material fact or (ii) omit to state any material fact necessary in order to make the representations, warranties, and information contained and to be contained herein and therein (in the light of the circumstances under which such representations, warranties, and information were or will be made or provided) not false or misleading.\n(b) None of the information supplied or to be supplied by or on\nbehalf of the Company for inclusion or incorporation by reference in the Form S-4 Registration Statement will, at the time the Form S-4 Registration Statement is filed with the SEC or at the time it becomes effective under the Securities Act, contain any untrue statement of a material fact or omit to state any material fact required to be stated therein or necessary in order to make the statements therein, in the light of the circumstances under which they are made, not misleading.\nNone of the information supplied or to be supplied by or on behalf of the Company for inclusion or incorporation by reference in the Proxy Statement will, at the time the Proxy Statement is mailed to the stockholders of the Company or at the time of the Company Stockholders Meeting, contain any untrue statement of a material fact or omit to state any material fact required to be stated therein or necessary in order to make the statements therein, in the light of the circumstances under which they are made, not misleading.\nThe Proxy Statement will comply as to form in all material respects with the provisions of the Exchange Act and the rules and regulations promulgated by the SEC thereunder.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 148,
  "section_name": null,
  "subsection_name": "REPRESENTATIONS AND WARRANTIES OF PARENT AND MERGER SUB",
  "text": "Each of Parent and Merger Sub represents and warrants to the Company as follows:",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 149,
  "section_name": "ARTICLE 3 REPRESENTATIONS AND WARRANTIES OF PARENT AND MERGER SUB",
  "subsection_name": "3.1 ORGANIZATION AND GOOD STANDING.",
  "text": " |  | (a) | Parent and each of its Subsidiaries are corporations or other\n | --- | --- | ---\n | entities duly organized, validly existing, and in good standing under the laws of their respective jurisdictions of incorporation or organization, with full corporate or other entity power and authority to conduct their respective businesses as now being conducted, to own or use the respective properties and assets that they purport to own or use, and to perform all their respective obligations under Contracts to which Parent or any of its Subsidiaries is a party or by which Parent or any of its Subsidiaries or any of their respective assets are bound. Parent and each of its Subsidiaries are duly qualified to do business as foreign corporations or other entities and are in good standing under the laws of each state or other jurisdiction in which either the ownership or use of the properties owned or used by them, or the nature of the activities conducted by them, requires such qualification, except where the failure to be so qualified, individually or in the aggregate, has not had and could not reasonably be expected to have a Parent Material Adverse Effect.\n |  was formed solely for the purpose of engaging in the Contemplated Transactions. Since the date of its incorporation and prior to the Effective Time, Merger Sub has not carried on any business or conducted any operations other than the execution of this Agreement, the performance of its respective obligations hereunder, and matters ancillary thereto. | (b) | Merger Sub is a direct, wholly owned subsidiary of Parent that\n |  | (c) | Parent has delivered to the Company copies of the\n | Organizational Documents of Parent and Merger Sub, as currently in effect.\n | 3.2 AUTHORITY; NO CONFLICT.\n |  power and authority to execute and deliver this Agreement, to perform its obligations hereunder, and to consummate the Contemplated Transactions. The execution and delivery of this Agreement by Parent and Merger Sub and the consummation by Parent and Merger Sub of the Contemplated Transactions have been duly and validly authorized by all necessary corporate action and no other corporate proceedings on the part of Parent or Merger Sub are necessary to authorize this Agreement or to consummate the Contemplated Transactions. This Agreement has been duly and validly executed and delivered by Parent and Merger Sub and constitutes the legal, valid, and binding obligation of Parent and Merger Sub, enforceable against Parent and Merger Sub in accordance with its terms. | (a) | Each of Parent and Merger Sub has all necessary corporate\n |  | (b) | Except as set forth in Part 3.2 of the Parent Disclosure\n\nSchedule, neither the execution and delivery of this Agreement nor the consummation of any of the Contemplated Transactions do or will, directly or indirectly (with or without notice or lapse of time or both):\n(i) contravene, conflict with, or result in a violation of (A) any provision of the Organizational Documents of Parent or any of its Subsidiaries, or (B) any resolution adopted by the board of directors or the stockholders of Parent or any of its Subsidiaries;\n(ii) contravene, conflict with, or result in a violation of, or give any Governmental Body or other Person the right to challenge any of the Contemplated Transactions or to exercise any remedy or obtain any relief under, any Legal Requirement or any Order to which Parent or any of its Subsidiaries, or any of the assets owned or used by Parent or any of its Subsidiaries, is or may be subject;\n(iii) contravene, conflict with, or result in a violation of any of the terms or requirements of, or give any Governmental Body the right to revoke, withdraw, suspend, cancel, terminate, or modify, any Governmental Authorization that is held by Parent or any of its Subsidiaries, or that otherwise relates to the business of, or any of the assets owned or used by, Parent or any of its Subsidiaries;\n(iv) cause Parent or any of its Subsidiaries to become subject to, or to become liable for the payment of, any Tax;\n(v) cause any of the assets owned by Parent or any of its Subsidiaries to be reassessed or revalued by any Taxing Authority or other Governmental Body;\n(vi) contravene, conflict with, or result in a violation or breach of any provision of, result in the loss of any benefit or the imposition of any additional payment or other liability under, give any Person the right to declare a default or exercise any remedy under, to accelerate the maturity or performance of, or to cancel, terminate, redeem, or modify, any Contract to which Parent or any of its Subsidiaries is party or by which Parent or any of its Subsidiaries or any of their respective assets are bound; or\n(vii) result in the imposition or creation of any Encumbrance upon or with respect to any of the assets owned or used by Parent or any of its Subsidiaries, except, in the case of clauses (ii), (iii), (iv), (v), (vi) and (vii), for any such conflicts, violations, breaches, defaults, or other occurrences that, individually or in the aggregate, have not had and could not reasonably be expected to have a Parent Material Adverse Effect.\nMerger Sub do not, and the performance of this Agreement and the consummation of the Contemplated Transactions by Parent and Merger Sub will not, require any Consent of, or filing with, or notification to, any Person, except (i) for (A) applicable requirements, if any, of the Exchange Act, the Securities Act, and Blue Sky Laws, (B) the pre-merger notification requirements of the HSR Act, (C) filing of a certificate of merger as required by the DGCL and (D) the non-United States competition, antitrust, and investment laws set forth in Part 3.2(c) of the Parent Disclosure Schedule and (ii) where failure to obtain such Consents, or to make such filings or notifications, individually or in the aggregate, have not had and could not reasonably be expected to have a Parent Material Adverse Effect.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 159,
  "section_name": "ARTICLE 3 REPRESENTATIONS AND WARRANTIES OF PARENT AND MERGER SUB",
  "subsection_name": "3.3 CAPITALIZATION",
  "text": "The authorized capital stock of Parent consists of shares of Parent Common Stock and shares of Parent Preferred Stock.\nAs of the date hereof, (a) shares of Parent Common Stock are issued and outstanding, all of which are duly authorized, validly issued, fully paid, and nonassessable, (b) shares of Parent Common Stock are reserved for issuance upon the exercise of outstanding stock options granted pursuant to Parent’s employee stock plans (“Parent Stock Options”), (c) shares of Parent Common Stock are reserved for issuance upon exercise of outstanding warrants of Parent, (d) shares of Parent Common Stock are held in the treasury of Parent, and (e) shares of Parent Common Stock are reserved for issuance pursuant to Parent Stock Options not yet granted.\nNo shares of Parent Preferred Stock are outstanding.\nExcept as set forth in this Section 3.3 or in Part 3.3 of the Parent Disclosure Schedule as of the date hereof, there are no options, stock appreciation rights, warrants or other rights, Contracts, arrangements, or commitments of any character (collectively, “Parent Options”) relating to the issued or unissued capital stock of Parent or any of its Subsidiaries, or obligating Parent or any of its Subsidiaries to issue, grant, or sell any shares of capital stock of, or other equity interests in, or securities convertible into equity interests in, Parent or any of its Subsidiaries.\nEach outstanding share of capital stock of each of Parent’s Subsidiaries is duly authorized, validly issued, fully paid, and nonassessable and each such share owned by Parent or one of its Subsidiaries is free and clear of all Encumbrances.\nNone of the outstanding equity securities or other securities of Parent or any of its Subsidiaries was issued in violation of the Securities Act or any other Legal Requirement.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 160,
  "section_name": "ARTICLE 3 REPRESENTATIONS AND WARRANTIES OF PARENT AND MERGER SUB",
  "subsection_name": "3.4 PARENT SEC REPORTS.",
  "text": "(a) Parent has on a timely basis filed all forms, reports, and\ndocuments required to be filed by it with the SEC since.\nPart 3.4 of the Parent\nSEC’s website through EDGAR two days prior to the date of this Agreement, Parent has delivered to the Company copies in the form filed with the SEC (including the full text of any document filed subject to a request for confidential treatment) of all forms, reports, registration statements, and other documents (other than preliminary materials if the corresponding definitive materials have been provided to the Company pursuant to this Section 3.4) filed by Parent with the SEC since (such forms, reports, registration statements, and other documents, whether or not available through EDGAR, are collectively referred to herein as the “Parent SEC Reports”). No Subsidiary of Parent is, or since has been, required to file any form, report, registration statement, or other document with the SEC. As used in this Section 3.4, the term “file” shall be broadly construed to include any manner in which a document or information is filed, furnished, transmitted, supplied, or otherwise made available to the SEC.\nof such report, complied with the requirements of the Securities Act, the Exchange Act, and the SOX, the rules and regulations thereunder, and (ii) as of its filing date (or, if amended or superseded by a subsequent filing prior to the date hereof, on the date of such filing) did not contain any untrue statement of a material fact or omit to state a material fact required to be stated therein or necessary in order to make the statements made therein, in the light of the circumstances under which they were made, not misleading.\napplicable listing rules and corporate governance rules and regulations of the NYSE.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 165,
  "section_name": "ARTICLE 3 REPRESENTATIONS AND WARRANTIES OF PARENT AND MERGER SUB",
  "subsection_name": "3.5 FINANCIAL STATEMENTS",
  "text": "Each of the financial statements (including, in each case, any notes thereto) contained or incorporated by reference in the Parent SEC Reports complied with the rules and regulations of the SEC as of the date of the filing of such reports, was prepared in accordance with GAAP and fairly presents the financial condition and the results of operations, changes in stockholders’ equity, and cash flow of Parent and its Subsidiaries as of the respective dates of and for the periods referred to in such financial statements, subject, in the case of interim financial statements, to (i) the omission of notes to the extent permitted by Regulation S-X (that, in the case of interim financial statements included in the Parent SEC Reports since Parent’s most recent annual report on Form 10-K, would not differ materially from the notes to the financial statements included in such annual report) and (ii) normal, recurring year-end adjustments (the effect of which will not, individually or in the aggregate, be material).\nThe financial statements referred to in this Section 3.5 reflect the consistent application of such accounting principles throughout the periods involved, except as disclosed in the notes to such financial statements.\nNo financial statements of any Person other than Parent and its Subsidiaries are, or, since have been, required by GAAP to be included in the consolidated financial statements of Parent.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 166,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.1 OPERATION OF THE COMPANY’S BUSINESS.",
  "text": " | (a) |  | During the Pre-Closing Period (except with the prior written\n | --- | --- | ---\n | Consent of Parent) the Company shall:\n | (i) ensure that each of the Company and each of its Subsidiaries\n\n(A) conducts its business in the ordinary course of business consistent with past practice and (B) complies with all applicable Legal Requirements and all Material Contracts (which for the purpose of this Section 4.1 shall include any Contract that would be a Material Contract if existing on the date of this Agreement); and\n(ii) use commercially reasonable efforts to ensure that the Company and each of its Subsidiaries preserve intact their current business organizations, keep available the services of their current officers and employees, and maintain their relations and goodwill with all suppliers, customers, landlords, creditors, licensors, licensees, employees, and other Persons having business relationships with the Company and each of its Subsidiaries, respectively.\nConsent of Parent), the Company shall not, and shall not permit any of its Subsidiaries to:\n(i) (A) declare, set aside, or pay any dividends on, or make any other distributions (whether in cash, stock, or property) in respect of, any of its capital stock or other equity or voting interests, except for dividends by a direct or indirect wholly owned Subsidiary of the Company to its parent, (B) split, combine, or reclassify any of its capital stock or other equity or voting interests, or issue or authorize the issuance of any other securities in respect of, in lieu of, or in substitution for shares of its capital stock or other equity or voting interests, (C) purchase, redeem, or otherwise acquire any shares of capital stock or any other securities of the Company or any of its Subsidiaries or any options, warrants, calls, or rights to acquire any such shares or other securities (including any Company Stock Options or shares of restricted stock except pursuant to forfeiture conditions of such restricted stock) or (D) take any action that would result in any change of any term (including any conversion price thereof) of any debt security of the Company or any of its Subsidiaries;\n(ii) issue, deliver, sell, pledge, or otherwise encumber any shares of its capital stock, any other equity or voting interests or any securities convertible into, or exchangeable for, or any options, warrants, calls, or rights to acquire or receive, any such shares, interests, or securities or any stock appreciation rights, phantom stock awards, or other rights that are linked in any way to the price of the Company Common Stock or the value of the Company or any part thereof (other than (x) the issuance of shares of Company Common Stock upon the exercise of Company Stock Options or rights under the employee stock purchase program (the “ESPP”) in accordance with their present terms and (y) the granting of rights that may arise under the terms of the ESPP, to the extent permitted in clause (xvi));\n(iii) amend or propose to amend its certificate of incorporation or bylaws (or similar organizational documents) or effect or become a party to any merger, consolidation, share exchange, business combination, recapitalization, or similar transaction;\n(iv) acquire by merger or consolidation, or by purchasing all or a substantial portion of the assets of, or by purchasing all or a substantial equity or voting interest in, or by any other manner, all or a substantial portion of any business or any Entity or division thereof;\n(v) acquire any material assets or a license therefor, other than in the ordinary course of business consistent with past practice, or make any capital expenditures, or incur any obligations or liabilities in connection therewith, except pursuant to existing Contracts or that, in the aggregate, would not exceed $ during any fiscal quarter;\n(vi) except in the ordinary course of business consistent with past practice, enter into, amend, or terminate any lease or sublease of real property (whether as a lessor, sublessor, lessee, or sublessee) or fail to exercise any right to renew any lease or sublease of real property;\n(vii) sell, grant a license in, or otherwise subject to any Encumbrance or otherwise dispose of any of its material properties or assets, other than the sale of inventory and the granting of nonexclusive licenses in the ordinary course of business consistent with past practice;\n(viii) repurchase, prepay, or incur any indebtedness or guarantee any indebtedness of another person or issue or sell any debt securities or options, warrants, calls, or other rights to acquire any debt securities of the Company or any of its Subsidiaries, guarantee any debt securities of another person, enter into any “keep well” or other agreement to maintain the financial condition of another Person, or enter into any arrangement having the economic effect of any of the foregoing;\n(ix) make any loans, advances, or capital contributions to, or investments in, any other Person, other than the Company or any direct or indirect wholly owned Subsidiary of the Company;\n(x) (A) pay, discharge, settle, or satisfy any material claims or Legal Proceeding (including claims of stockholders and any stockholder litigation relating to this Agreement, the Merger, or any other Contemplated Transaction or otherwise), (B) waive, release, grant, or transfer any right of material value other than in the ordinary course of business consistent with past practice, or (C) commence any Legal Proceeding;\n(xi) enter into any Material Contract:\n(xii) amend, modify, change, or terminate any Material Contract to which the Company or any of its Subsidiaries is a party, or waive, release, or assign any rights or claims thereunder, in each case other than in the ordinary course of business;\n(xiii) except as required by applicable Legal Requirements, adopt or enter into any collective bargaining agreement or other labor union Contract applicable to the employees of the Company or any of its Subsidiaries;\n(xiv) hire any new employee at the level of [manager] or above or with an annual base salary in excess of $, promote any employee except in order to fill a position vacated after the date of this Agreement, or engage any independent contractor whose engagement may not be terminated by the Company without penalty on 30 days’ notice or less;\n(xv) increase in any manner the compensation or benefits of, or pay any bonus to, any employee, officer, director, or independent contractor of the Company or any of its Subsidiaries, except for such increases or bonuses that were disclosed to Parent prior to the date of this Agreement;\n(xvi) except as required to comply with Legal Requirements or any Contract or Company Benefit Plan in effect on the date of this Agreement and disclosed in Part 2.11(c) of the Company Disclosure Schedule:\n(xvii) (A) fail to accrue a reserve in its books and records and financial statements in accordance with past practice for Taxes payable by the Company or any of its Subsidiaries, (B) settle or compromise any Legal Proceeding relating to any Tax, or (C) make, change, or revoke any Tax election;\n(xviii) except as required by GAAP or applicable Legal Requirements, change its fiscal year, revalue any of its material assets, or make any changes in financial or Tax accounting methods, principles, or practices;\n(xix) take any action (or omit to take any action) if such action (or omission) would, or would be reasonably likely to result in (A) any representation and warranty of the Company set forth in this Agreement that is qualified as to materiality becoming untrue (as so qualified) or (B) any such representation and warranty that is not so qualified becoming untrue in any material respect;\n(xx) keep in full force all insurance policies referred to in Section 2.16; and\n(xxi) authorize any of, or commit, resolve, or agree to take any of, the foregoing actions.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 191,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.2 ACCESS AND INVESTIGATION.",
  "text": "(a) During the period from the date of this Agreement through the\nEffective Time or the earlier termination of this Agreement in accordance with Article 7 hereof (the “Pre-Closing Period”), the Company shall, and shall cause the Representatives of the Company and its Subsidiaries to, (i) provide Parent and Parent’s Representatives with access to the Representatives of the Company and its Subsidiaries, personnel and assets, books, records, Tax Returns, work papers, and other documents, and additional financial, operating, and other data and information regarding the Company and its Subsidiaries, and provide copies thereof to Parent, in each case as Parent may request and (ii) cause its officers to confer regularly with Parent concerning the status of the Company’s business as Parent may request.\nIn addition, during the Pre-Closing Period, the Company shall promptly provide Parent with (A) all material operating and financial reports prepared by the Company and its Subsidiaries for the Company’s management, including copies of the unaudited monthly consolidated financial statements; and (B) any other written reports or other written materials requested by Parent.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 193,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.3 NOTIFICATION.",
  "text": "(a) During the Pre-Closing Period, the Company shall promptly,\nbut in any event no less than one Business Day following any such event, notify Parent in writing of:\n(i) the discovery by the Company of any event, condition, fact, or circumstance that occurred or existed on or prior to the date of this Agreement and that caused or constitutes a material inaccuracy in any representation or warranty made by the Company in this Agreement;\n(ii) any event, condition, fact, or circumstance that occurs, arises, or exists after the date of this Agreement and that would have caused or constituted a material inaccuracy in any representation or warranty made by the Company in this Agreement if such representation or warranty had been made as of the time of the occurrence, existence, or discovery of such event, condition, fact, or circumstance;\n(iii) any material breach of any covenant of the Company under this Agreement;\n(iv) any event, condition, fact, or circumstance that would make the timely satisfaction of any of the conditions set forth in Article 5 or Article 6 impossible or unlikely or that has had or could reasonably be expected to have a Company Material Adverse Effect; and\n(v) (A) any notice or other communication from any Person alleging that the Consent of such Person is or may be required in connection with the Contemplated Transactions, and (B) any Legal Proceeding or material claim threatened, commenced, or asserted against or with respect to the Company or any of its Subsidiaries or the Contemplated Transactions.\n(b) No notification given to Parent pursuant to this Section 4.3\nshall limit or otherwise affect any of the representations, warranties, covenants, or obligations of the Company contained in this Agreement.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 202,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.4 NO SOLICITATION.",
  "text": "(a) The Company shall not directly or indirectly, and shall not\nauthorize or permit any of its Subsidiaries or any Representative of the Company or any of its Subsidiaries directly or indirectly to, (i) solicit, initiate, encourage, induce, or facilitate the making, submission, or announcement of any Acquisition Proposal or take any action that could reasonably be expected to lead to an Acquisition Proposal, (ii) furnish any nonpublic information regarding the Company or any of its Subsidiaries to any Person in connection with or in response to an Acquisition Proposal or an inquiry or indication of interest that could reasonably be expected to lead to an Acquisition Proposal, (iii) engage in discussions or negotiations with any Person with respect to any Acquisition Proposal, (iv) approve, endorse, or recommend any Acquisition Proposal or (v) enter into any letter of intent or similar document or any Contract contemplating or otherwise relating to any Acquisition Transaction; provided, however, that prior to the adoption of this Agreement by the Required Stockholder Vote, this Section 4.4(a) shall not prohibit the Company from furnishing nonpublic information regarding the Company and its Subsidiaries to, or entering into discussions with, any Person in response to an Acquisition Proposal that is, or is reasonably likely to result in, a Superior Proposal that is submitted to the Company by such Person (and not withdrawn prior to the furnishing of such information or such discussions) if (1) neither the Company nor any Representative of the Company or any of its Subsidiaries shall have violated any of the restrictions set forth in this Section 4.4, (2) the Company Board concludes in good faith, after having taken into account the advice of its outside legal counsel, that such action is required in order for the Company Board to comply with its fiduciary obligations to the Company’s stockholders under applicable Legal Requirements, (3) at least two Business Days prior to furnishing any such nonpublic information to, or entering into discussions with, such Person, the Company gives Parent written notice of the identity of such Person and of the Company’s intention to furnish nonpublic information to, or enter into discussions with, such Person, and the Company receives from such Person an executed confidentiality agreement containing customary limitations on the use and disclosure of all nonpublic written and oral information furnished to such Person by or on behalf of the Company and containing terms no less favorable to the Company than the terms of the Confidentiality Agreement, and (4) at least two Business Days prior to furnishing any such nonpublic information to such Person, the Company furnishes such nonpublic information to Parent (to the extent such nonpublic information has not been previously furnished by the Company to Parent).\nWithout limiting the generality of the foregoing, the Company acknowledges and agrees that any violation of or the taking of any action inconsistent with any of the restrictions set forth in the preceding sentence by any Representative of the Company or any of its Subsidiaries, whether or not such Representative is purporting to act on behalf of the Company or any of its Subsidiaries, shall be deemed to constitute a breach of this Section 4.4 by the Company.\nhours after receipt of any Acquisition Proposal, any inquiry or indication of interest that could lead to an Acquisition Proposal, or any request for nonpublic information) advise Parent orally and in writing of any Acquisition Proposal, any inquiry or indication of interest that could lead to an Acquisition Proposal, or any request for nonpublic information relating to the Company or any of its Subsidiaries (including the identity of the Person making or submitting such Acquisition Proposal, inquiry, indication of interest, or request, and the terms thereof) that is made or submitted by any Person during the Pre- Closing Period.\nThe Company shall keep Parent fully informed with respect to the status of any such Acquisition Proposal, inquiry, indication of interest, or request and any modification or proposed modification thereto.\nBusiness Days after the date of this Agreement, the Company and Parent shall prepare the Proxy Statement and Parent shall prepare the Form S-4 Registration Statement, in which the Proxy Statement will be included, with respect to the issuance of Parent Common Stock in the Merger and cause it to be filed with the SEC. The Company and Parent shall each furnish all information concerning it and the holders of its capital stock as the other may reasonably request in connection with the preparation of the Form S-4 Registration Statement and the Proxy Statement and any amendment thereto.\nParent and the Company shall each use commercially reasonable efforts to cause the Form S-4 Registration Statement and the Proxy Statement to comply with the rules and regulations promulgated by the SEC, to respond promptly to any comments of the SEC or its staff, and to have the Form S-4 Registration Statement declared effective under the Securities Act as promptly as practicable after it is filed with the SEC. The Company will cause the Proxy Statement to be mailed to its stockholders as promptly as practicable, and in no event later than three Business Days, after the Form S-4 Registration Statement is declared effective under the Securities Act. Each of Parent and the Company shall use commercially reasonable efforts to cause all documents that it is responsible for filing with the SEC in connection with the Contemplated Transactions to comply as to form and substance in all material respects with the applicable requirements of the Securities Act and the Exchange Act. Parent shall also promptly file, and use commercially reasonable efforts to cause to become effective as promptly as possible, any amendment to the Form S-4 Registration Statement, including the Proxy Statement and, if required, the Company shall mail to its stockholders any such amendment that becomes necessary after the date the Form S-4 Registration Statement is declared effective.\nreasonable efforts to qualify the Parent Common Stock under the Blue Sky Laws of such jurisdictions as may be required; provided, however, that Parent shall not be required to",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 207,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.6 COMPANY STOCKHOLDERS MEETING.",
  "text": " | (a) | The Company shall take all action necessary under all\n | applicable Legal Requirements to call, give notice of, and hold a meeting of the holders of Company Common Stock to vote on a proposal to adopt this Agreement (the “Company Stockholders Meeting”), shall submit such proposal to such holders at the Company Stockholders Meeting, and shall not submit any other proposal to such holders in connection with the Company Stockholders Meeting (other than a proposal relating to executive compensation as may be required by Rule 14a-21(c) under the Exchange Act), without the prior written Consent of Parent. The Company (in consultation with Parent) shall set a single record date for persons entitled to notice of, and to vote at, the Company Stockholders Meeting and shall not change such record date (whether in connection with the Company Stockholders Meeting or any adjournment or postponement thereof) without the prior written Consent of Parent. The Company Stockholders Meeting shall be held (on a date selected by the Company in consultation with Parent) as promptly as practicable after the Form S 4 Registration Statement is declared effective under the Securities Act. Subject to Section 4.6(c), the Proxy Statement shall include the recommendation of the Company Board that the Company’s stockholders vote to adopt this Agreement at the Company Stockholders Meeting (the recommendation of the Company Board being referred to as the “Board Recommendation”). The Company shall ensure that all proxies solicited in connection with the Company Stockholders Meeting are solicited in compliance with all applicable Legal Requirements.\n | (b) | Subject to Section 4.6(c), neither the Company Board nor any\n | committee thereof shall: (i) withdraw or modify the Board Recommendation in a manner adverse to Parent, or adopt or propose a resolution to withdraw or modify the Board Recommendation in a manner adverse to Parent or take any other action that is or becomes disclosed publicly and which can reasonably be interpreted to indicate that the Company Board or any committee thereof does not support the Merger and this Agreement or does not believe that the Merger and this Agreement are in the best interests of the Company’s stockholders; (ii) fail to reaffirm, without qualification, the Board Recommendation, or fail to state publicly, without qualification, that the Merger and this Agreement are in the best interests of the Company’s stockholders, within five Business Days after Parent requests in writing that such action be taken; (iii) fail to announce publicly, within 10 Business Days after a tender offer or exchange offer relating to securities of the Company shall have been commenced, that the Company Board recommends rejection of such tender or exchange offer; (iv) fail to issue, within 10 Business Days after an Acquisition Proposal is publicly announced, a press release announcing its opposition to such Acquisition Proposal; (v) approve, endorse. or recommend any Acquisition Proposal; or (vi) resolve or propose to take any action described in clauses (i) through (v) of this sentence (each of the foregoing actions described in clauses (i) through\n | (vi) of this sentence being referred to as a “Change in Recommendation”).\n | (c) | Notwithstanding anything to the contrary contained in Section\n\n4.6(b), at any time prior to the adoption of this Agreement by the Required Stockholder Vote, the Company Board may effect, or cause the Company to effect, as the case may be, a Change in Recommendation:\n(i) if: (A) after the date of this Agreement, an unsolicited, bona fide, written offer to effect a transaction of the type referred to in the definition of the term Superior Proposal is made to the Company and is not withdrawn; (B) such unsolicited, bona fide, written offer was not obtained or made as a direct or indirect result of a breach of (or any action inconsistent with) this Agreement, the Confidentiality Agreement, or any “standstill” or similar agreement under which the Company or any of its Subsidiaries has any rights or obligations; (C) at least five Business Days prior to any meeting of the Company Board at which the Company Board will consider and determine whether such offer is a Superior Proposal, the Company provides Parent with a written notice specifying the date and time of such meeting, the reasons for holding such meeting, the terms and conditions of the offer that is the basis of the potential action by the Company Board (including a copy of any draft definitive agreement reflecting the offer), and the identity of the Person making the offer; (D) the Company Board determines in good faith, after obtaining and taking into account the advice of an independent financial advisor of nationally recognized reputation and the advice of outside legal counsel, that such offer constitutes a Superior Proposal; (E) the Company Board does not effect, or cause the Company to effect, a Change in Recommendation at any time within five Business Days after Parent receives written notice from the Company confirming that the Company Board has determined that such offer is a Superior Proposal; (F) during such five Business Day period, if requested by Parent, the Company engages in good faith negotiations with Parent to amend this Agreement in such a manner that the offer that was determined to constitute a Superior Proposal no longer constitutes a Superior Proposal; (G) at the end of such five Business Day period, such offer has not been withdrawn and continues to constitute a Superior Proposal (taking into account any changes to the terms of this Agreement proposed by Parent as a result of the negotiations required by clause “(F)” or otherwise); and (H) the Company Board determines in good faith, after obtaining and taking into account the advice of outside legal counsel, that, in light of such Superior Proposal, a Change in Recommendation is required in order for the Company Board to comply with its fiduciary obligations to the Company’s stockholders under applicable Legal Requirements (it being understood that in the event of any revisions to the terms of a Superior Proposal, the provisions of this Section 4.6(c)(i) shall apply to such revised offer as if it were a new offer hereunder); or (ii) if: (A) a material development or change in circumstances occurs or arises after the date of this Agreement that was neither known to the Company or any of its Subsidiaries or any of their Representatives nor reasonably foreseeable to the Company or any of its Subsidiaries or any of their Representatives as of the date of this Agreement (such material development or change in circumstances being referred to as an “Intervening Event”); (B) at least five Business Days prior to any meeting of the Company Board at which the Company Board will consider and determine whether such Intervening Event requires the Company Board to effect, or cause the Company to effect, a Company Change in Recommendation, the Company provides Parent with a written notice specifying the date and time of such meeting and the reasons for holding such meeting; (C) during such five Business Day period, if requested by Parent, the Company engages in good-faith negotiations with Parent to amend this Agreement in a manner that obviates the need for the Company Board to effect, or cause the Company to effect, a Change in Recommendation as a result of such Intervening Event; and (D) the Company Board determines in good faith, after obtaining and taking into account the advice of outside legal counsel, that, in light of such Intervening Event, a Change in Recommendation is required in order for the Company Board to comply with its fiduciary obligations to the Company’s stockholders under applicable Legal Requirements.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 210,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.7 COOPERATION; REGULATORY APPROVALS",
  "text": " | (a) | Subject to Section 4.7(c) and 4.7(d), Parent and the Company\n | shall cooperate fully with each other and shall use commercially reasonable efforts to take, or cause to be taken, all actions necessary to consummate the Merger and make effective the other Contemplated Transactions. Without limiting the generality of the foregoing, but subject to Section 4.7(c) and 4.7(d), Parent and the Company (i) shall make all filings (if any) and give all notices (if any) required to be made and given by such Party in connection with the Merger and the other Contemplated Transactions, and shall submit promptly any additional information requested in connection with such filings and notices, (ii) shall use commercially reasonable efforts to obtain each Consent (if any) required to be obtained (pursuant to any applicable Legal Requirement or Contract, or otherwise) by such Party in connection with the Merger or any of the other Contemplated Transactions, and (iii) shall use commercially reasonable efforts to oppose or to lift, as the case may be, any restraint, injunction, or other legal bar to the Merger. The Company shall promptly deliver to Parent a copy of each such filing made, each such notice given, and each such Consent obtained, by the Company during the Pre-Closing Period.\n | (b) and Parent shall, promptly after the date of this Agreement prepare and in no event later than five Business Days after the date of this Agreement file the notifications required under the HSR Act, and prepare and file as promptly as practicable any applicable foreign Antitrust Laws or regulations in connection with the Merger. The Company and Parent shall respond as promptly as practicable to any inquiries or requests received from any Governmental Body in connection with antitrust or related matters. Each of the Company and Parent shall (i) give the other Party prompt notice of the commencement or threat of commencement of any Legal Proceeding by or before any Governmental Body with respect to the Merger or any of the other Contemplated Transactions, (ii) keep the other Party informed as to the status of any such Legal Proceeding or threat, and (iii) promptly inform the other Party of any material communication concerning Antitrust Laws to or from any Governmental Body regarding the Merger. Except as may be prohibited by any Governmental Body or by any Legal Requirement, the Company and Parent will consult and cooperate with one another, and will consider in good faith the views of one another, in connection with any analysis, appearance, presentation, memorandum, brief, argument, opinion, or proposal made or submitted in connection with any Legal Proceeding under or relating to the HSR Act or any other Antitrust Law. Subject to the foregoing, Parent shall be principally responsible for and in control of the process of dealing with any Governmental Body concerning the effect of applicable Antitrust Laws on the Contemplated Transactions. In addition, except as may be prohibited by any Governmental Body or by any Legal Requirement, in connection with any Legal Proceeding under or relating to the HSR Act or any other foreign, federal, or state antitrust or fair trade law or any other similar Legal Proceeding, the Company will permit authorized Representatives of Parent to be present at each meeting or conference relating to any such Legal Proceeding and to have access to and be consulted in connection with any document, opinion, or proposal made or submitted to any Governmental Body in connection with any such Legal Proceeding. | Without limiting the generality of Section 4.7(a), the Company\n | (c) | At the request of Parent, the Company shall agree to divest,\n | sell, dispose of, hold separate, or otherwise take or commit to take any action that limits its freedom of action with respect to its or its Subsidiaries’ ability to retain any of the businesses, product lines, or assets of the Company or any of its Subsidiaries, provided that any such action is conditioned upon the consummation of the Merger.\n | (d) | Notwithstanding anything to the contrary contained in this\n\nAgreement, Parent shall not have any obligation under this Agreement to (and the Company shall not, unless requested to do so by Parent): (i) dispose of, transfer, or hold separate, or cause any of its Subsidiaries to dispose of, transfer, or hold separate any assets or operations, or commit or cause the Company or any of its Subsidiaries to dispose of, transfer, or hold separate any assets; (ii) discontinue or cause any of its Subsidiaries to discontinue offering any product or service, or commit to cause the Company or any of its Subsidiaries to discontinue offering any product or service; (iii) make or cause any of its Subsidiaries to make any commitment (to any Governmental Body or otherwise) regarding its future operations or the future operations of the Company or any of its Subsidiaries.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 212,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.8 DISCLOSURE",
  "text": "Parent and the Company shall consult with each other before issuing any press release or otherwise making any public statement or disclosure with respect to the Merger or any of the other Contemplated Transactions and neither shall issue any press release or make any public statement or disclosure regarding the Merger or any of the other Contemplated Transactions without the prior approval of the other (which approval shall not be unreasonably withheld, conditioned, or delayed), except as may be required by applicable Legal Requirements or by obligations pursuant to any listing agreement with any national securities exchange, in which case the party proposing to issue such press release or make such public statement or disclosure shall first, to the extent practicable, consult with the other party about, and allow the other party reasonable time to comment in advance on, such press release, public announcement, or disclosure.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 213,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.9 TAX MATTERS",
  "text": "Parent and the Company shall not take any action prior to Closing that could reasonably be expected to cause the Merger not to qualify as a reorganization under Section 368(a) of the Code.\nParent and the Company shall use their respective commercially reasonable efforts to cause [PARENT COUNSEL], counsel to Parent, and [COMPANY COUNSEL], counsel to the Company, to deliver the tax opinions referred to in Sections 5.2 and 6.9, respectively, and shall each execute and deliver to such counsel tax representation letters in customary form.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 214,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.10 RESIGNATION OF DIRECTORS",
  "text": "The Company shall use commercially reasonable efforts to obtain and deliver to Parent prior to the Closing Date (to be effective as of the Effective Time) the resignation of each director of the Company and each of its Subsidiaries (in each case, in their capacities as directors, and not as employees) as Parent shall request in writing not less than five days prior to the Closing Date.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 215,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.11 LISTING",
  "text": "Parent shall use commercially reasonable efforts to cause the shares of Parent Common Stock to be issued in the Merger pursuant to this Agreement to be approved for listing (subject to official notice of issuance) on the NYSE.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 216,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.12 PARENT BOARD",
  "text": "Prior to the Effective Time, Parent shall increase the number of directors of Parent by one and, subject to the fiduciary duties of the board of directors of Parent, elect, as of the Effective Time, as a director of Parent.\nIf is not able or willing to serve as a director of Parent as of the Effective Time, the Company Board shall select a replacement, and Parent shall use commercially reasonable efforts, subject to approval of its Nominating Committee, to elect, as of the Effective Time, such replacement as a director of Parent.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 217,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.13 COMPANY RIGHTS AGREEMENT",
  "text": "The Company shall not amend, terminate, or grant any waiver of any provision of, or redeem the rights issued under, the Company Rights Agreement.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 218,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.14 RULE 16B-3",
  "text": "Parent, Merger Sub, and the Company shall take all such steps as may be required to cause the transactions contemplated by Article 1 and Section 4.15 and any other dispositions of equity securities of the Company (including derivative securities) or acquisitions of equity securities of Parent in connection with this Agreement by each individual who (a) is a director or officer of the Company subject to Section 16 of the Exchange Act, or (b) at the Effective Time is or will become a director or officer of Parent subject to Section 16 of the Exchange Act, to be exempt under Rule 16b-3 promulgated under the Exchange Act.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 219,
  "section_name": "ARTICLE 4 CERTAIN COVENANTS",
  "subsection_name": "4.15 STOCK PLANS. > (a) Subject to Section 4",
  "text": "15(b), at the Effective Time, all rights with\nrespect to Company Common Stock under each Company Option then outstanding,\nwhether vested or unvested, shall be converted into and become rights with respect to\nParent Common Stock, and Parent shall assume each such Company Stock Option (as so\nassumed, an “Assumed Stock Option”).\nFrom and after the Effective Time, each Assumed\nStock Option shall continue to be subject to the same terms and conditions as were\napplicable to such Company Option immediately prior to the Effective Time in accordance\nwith the stock option plan under which it was issued and the stock option agreement by\nwhich it is evidenced, except that:\nTo the extent that a Company Option qualifies immediately prior to the Effective Time as an “incentive stock option” within the meaning of Section 422 of the Code, the option exercise price, the number of shares of Parent Common Stock purchasable pursuant to the Assumed Option, and the terms and conditions of exercise of the Assumed Stock Option shall be determined in order to comply with Section 424(a) of the Code.\nAs soon after the Effective Time as practicable, Parent shall file with the SEC a registration statement on Form S-8 relating to the shares of Parent Common Stock issuable with respect to the Assumed Stock Options.\n | (b) |  | In lieu of assuming outstanding Company Stock Options in\n | --- | --- | ---\n | accordance with Section 4.15(a), Parent may, in its discretion, issue reasonably equivalent replacement stock options in substitution for outstanding Company Stock Options, provided that the number of shares of Parent Common Stock subject to and the per share exercise price under each such replacement option shall be determined in the same manner as set forth in Section 4.15(a), and provided further that such replacement stock options are not treated as a payment in substitution of deferred compensation under Treasury Regulation Section 1.409A-3(f).\n | (c) that may be necessary (under the plans pursuant to which Company Stock Options are outstanding and otherwise) to effectuate the provisions of this Section 4.15 and to ensure that, from and after the Effective Time, holders of Company Stock Options have no rights with respect thereto other than those specifically provided in this Section 4.15. In addition, the Company shall provide notice (subject to reasonable review by Parent) to each holder of Company Stock Options describing the treatment of such Company Stock Options in accordance with this Section 4.15. |  | Prior to the Effective Time, the Company shall take all action\n | (d) |  | Prior to the Effective Time, the Company shall take all actions\n | (including, if appropriate, amending the terms of the ESPP) that are necessary to:\n | (i) cause the ending date of the then current Purchase Period (as such term is defined in the ESPP) to occur on or before the last trading day prior to the Effective Time (the “Final Purchase Date”),\n\n(ii) cause all then existing offerings under the ESPP to terminate immediately following the purchase on the Final Purchase Date,\n(iii) suspend all future offerings that would otherwise commence under the ESPP following the Final Purchase Date, and\n(iv) cease all further payroll deductions under the ESPP effective as of the Final Purchase Date.\nOn the Final Purchase Date, the Company shall apply the funds credited as of such date under the ESPP within each participant’s payroll withholding account to the purchase of whole shares of Company Common Stock in accordance with the terms of the ESPP, which shares shall be treated in the manner described in Section 1.5.\nThe Company shall provide notice (in a form reasonably satisfactory to Parent) to each participant in the ESPP describing the treatment of purchase rights under the ESPP in accordance with this Section 4.15.\n | (e) | Employees of the Company as of the Effective Time shall be\n | permitted to participate in Parent’s ESPP commencing on the first enrollment date of such plan following the Effective Time, subject to the eligibility provisions of such plan (with employees receiving credit, for purposes of such eligibility provisions, for service with the Company and Parent).\n | (f) immediately prior to the Effective Time are unvested or are subject to a repurchase option, risk of forfeiture, or other condition under any applicable restricted stock purchase agreement or other agreement with the Company or under which the Company has any rights, then the shares of Parent Common Stock issued in exchange for such shares of Company Common Stock will also be unvested and subject to the same repurchase option, risk of forfeiture, or other condition, and the certificates representing such shares of Parent Common Stock may accordingly be marked with appropriate legends. The Company shall take all action that may be necessary to ensure that, from and after the Effective Time, Parent is entitled to exercise any such repurchase option or other right set forth in any such restricted stock purchase agreement or other agreement. | If any shares of Company Common Stock outstanding\n | (g) | None of the Company’s stock option or other equity\n | compensation plans shall be deemed to be terminated by virtue of the Merger.\n | 4.16 EMPLOYEE BENEFITS.\n | (a) provide or cause to be provided to employees of the Surviving Corporation after the Effective Time (a “Continuing Employee”) employee benefits that are not materially less favorable, in the aggregate, to the employee benefits provided by the Company on the date hereof; provided, however, that nothing in this Section 4.16 or elsewhere in this Agreement shall limit the right of Parent or the Surviving Corporation to amend or terminate the employment of any individual or to amend or terminate any employee benefit plan, program, or arrangement. Nothing in this paragraph shall be interpreted to require Parent to provide for the participation of any Continuing Employee in any benefit plan of Parent or its Affiliates (the “Parent Benefit Plans”). This Section is not intended, and shall not be deemed, to confer any rights or remedies upon any Person other than the parties to this Agreement and their respective successors and permitted assigns, to create any agreement of employment with any Person or otherwise to create any third-party beneficiary hereunder, or to be interpreted as an amendment to any plan of Parent or any affiliate of Parent. Furthermore, nothing in this Agreement shall be construed to create a right in any Continuing Employee to employment with Parent, the Surviving Corporation, or any other Subsidiary of Parent and, subject to any agreement between a Continuing Employee and Parent, the Surviving Corporation or any other Subsidiary of Parent, the employment of each Continuing Employee shall be “at will” employment. | Following the Effective Time, the Surviving Corporation shall\n | (b) | Prior to the Effective Time, the Company shall, if requested to\n\ndo so by Parent, terminate its defined contribution 401(k) plan.\nParent shall provide, or cause the Surviving Corporation to provide, that each Continuing Employee who is a participant in the Company’s 401(k) plan shall be given the opportunity to elect to “roll over” his or her account balance (including any promissory note evidencing an outstanding loan) from the terminated plan to a tax-qualified defined contribution plan maintained by Parent or the Surviving Corporation.\n4.17 INDEMNIFICATION OF OFFICERS AND DIRECTORS.\nMerger and continue in full force and effect and is intended to benefit, and shall be enforceable by each Indemnified Person as a third-party beneficiary.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 239,
  "section_name": null,
  "subsection_name": "CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "text": "The obligations of Parent and Merger Sub to effect the Merger and otherwise consummate the Contemplated Transactions are subject to the satisfaction, or waiver by Parent, at or before the Closing, of each of the following conditions:",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 240,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.1 ACCURACY OF REPRESENTATIONS",
  "text": "Each of the representations and warranties of the Company (i) set forth in Section 2.2(a), Section 2.3, Section 2.20, and Section 2.22 shall be true and correct in all respects as of the date of this Agreement, and as of the Closing as though made on the Closing, (ii) set forth in Section 2.7(b)(i) shall be true and correct in all respects as of the date of this Agreement, and as of the Closing as though made on the Closing and (iii) set forth in this Agreement, other than those described in clauses (i) and (ii) above, shall be true and correct (disregarding all qualifications or limitations as to “materiality,” “Company Material Adverse Effect” and words of similar import set forth therein) as of the date of this Agreement, and as of the Closing as though made on the Closing, except, in the case of this clause (iii), where the failure of such representations and warranties to be so true and correct would not, individually or in the aggregate, reasonably be expected to have a Company Material Adverse Effect; provided in each case that representations and warranties made as of a specific date shall be required to be so true and correct (subject, in the case of the representations and warranties described in this clause (iii), to such qualifications) as of such date only.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 241,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.2 PERFORMANCE OF COVENANTS",
  "text": "Each of the covenants and obligations in this Agreement that the Company is required to comply with or perform at or prior to the Closing shall have been complied with or performed in all material respects.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 242,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.3 CERTIFICATE",
  "text": "The Company shall have provided Parent with a certificate from the chief executive officer and the chief financial officer of the Company certifying that the conditions set forth in Sections 5.1 and 5.2 have been satisfied.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 243,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.4 EFFECTIVENESS OF FORM S-4 REGISTRATION STATEMENT",
  "text": "The Form S-4 Registration Statement shall have been declared effective by the SEC in accordance with the provisions of the Securities Act, no stop order suspending the effectiveness of the Form S-4 Registration Statement shall have been issued by the SEC, and no proceeding for that purpose shall have been initiated or threatened by the SEC.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 244,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.5 STOCKHOLDER APPROVAL",
  "text": "The Required Stockholder Vote shall have been obtained.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 245,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.6 LISTING",
  "text": "The shares of Parent Common Stock to be issued in the Merger pursuant to this Agreement shall have been approved for listing (subject to official notice of issuance) on the NYSE.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 246,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.7 NO MATERIAL ADVERSE EFFECT",
  "text": "Since the date of this Agreement, a Company Material Adverse Effect shall not have occurred.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 247,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.8 COMPETITION LAWS",
  "text": "The waiting period applicable to the consummation of the Merger under the HSR Act shall have expired or been terminated, any similar waiting period under any applicable foreign antitrust law or regulation shall have expired or been terminated, and any Consent required under any applicable foreign antitrust law or regulation shall have been obtained.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 248,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.9 CONSENTS",
  "text": "The Consents set forth on Schedule 5.9 shall have been obtained and shall remain in effect.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 249,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.10 NO RESTRAINTS",
  "text": "No temporary restraining order, preliminary or permanent injunction, or other Order of a Governmental Body prohibiting the consummation of the Merger shall be in effect, and no Legal Requirement shall be in effect that makes consummation of the Merger illegal or otherwise prohibits or interferes with the consummation of the Merger.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 250,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.11 NO LITIGATION",
  "text": "No Legal Proceeding shall be pending or threatened:\n(a) challenging or seeking to restrain or prohibit the consummation of the Merger or any of the other Contemplated Transactions; (b) seeking to prohibit or limit Parent’s ability to vote, receive dividends with respect to or otherwise exercise ownership rights with respect to the stock of the Surviving Corporation; (c) which would materially and adversely affect the right of the Surviving Corporation to own the assets or operate the business of the Company and its Subsidiaries; or (d) seeking to compel Parent or the Company or any Subsidiary of Parent or the Company to dispose of or hold separate any material assets, as a result of the Merger or any of the other Contemplated Transactions.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 252,
  "section_name": "ARTICLE 5 CONDITIONS PRECEDENT TO OBLIGATIONS OF PARENT AND MERGER SUB",
  "subsection_name": "5.12 TAX OPINION",
  "text": "Parent shall have received a legal opinion from [PARENT COUNSEL], counsel to Parent, dated as of the Closing Date and addressed to Parent, to the effect that for federal income tax purposes, the Merger will constitute a reorganization within the meaning of Section 368(a) of the Code.\nIn rendering such opinion, counsel to Parent may rely upon the tax representation letters referred to in Section 4.9.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 253,
  "section_name": null,
  "subsection_name": "CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "text": "The obligation of the Company to effect the Merger and otherwise consummate the Contemplated Transactions is subject to the satisfaction, or waiver by the Company, at or before the Closing, of each of the following conditions:",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 254,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.1 ACCURACY OF REPRESENTATIONS",
  "text": "Each of the representations and warranties of Parent and Merger Sub set forth in this Agreement shall be true and correct (disregarding all qualifications or limitations as to “materiality,” “Parent Material Adverse Effect” and words of similar import set forth therein) as of the date of this Agreement, and as of the Closing as though made on the Closing, except where the failure of such representations and warranties to be so true and correct would not, individually or in the aggregate, reasonably be expected to have a Parent Material Adverse Effect; provided in each case that representations and warranties made as of a specific date shall be required to be so true and correct (subject to such qualifications) as of such date.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 255,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.2 PERFORMANCE OF COVENANTS",
  "text": "Each of the covenants and obligations in this Agreement that Parent or Merger Sub, as applicable, is required to comply with or perform at or prior to the Closing Date shall have been complied with or performed in all material respects.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 256,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.3 CERTIFICATE",
  "text": "Parent shall have provided the Company with a certificate from an officer of Parent certifying that the conditions set forth in Sections 6.1 and 6.2 have been satisfied.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 257,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.4 EFFECTIVENESS OF FORM S-4 REGISTRATION STATEMENT",
  "text": "The Form S-4 Registration Statement shall have been declared effective by the SEC in accordance with the provisions of the Securities Act, no stop order suspending the effectiveness of the Form S-4 Registration Statement shall have been issued by the SEC, and no proceeding for that purpose shall have been initiated or threatened by the SEC.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 258,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.5 STOCKHOLDER APPROVAL",
  "text": "The Required Stockholder Vote shall have been obtained.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 259,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.6 LISTING",
  "text": "The shares of Parent Common Stock to be issued in the Merger pursuant to this Agreement shall have been approved for listing (subject to official notice of issuance) on the NYSE.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 260,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.7 COMPETITION LAWS",
  "text": "The waiting period applicable to the consummation of the Merger under the HSR Act shall have expired or been terminated, any similar waiting period under any applicable foreign Antitrust Law or regulation set forth on Schedule 6.7 shall have expired or been terminated, and any Consent required under any applicable foreign Antitrust Law set forth on Schedule 6.7 shall have been obtained.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 261,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.8 NO RESTRAINTS",
  "text": "No temporary restraining Order, preliminary or permanent injunction, or other Order of a Government Body prohibiting the consummation of the Merger shall be in effect, and no Legal Requirement shall be in effect that makes consummation of the Merger illegal or otherwise prohibits or interferes with the consummation of the Merger.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 262,
  "section_name": "ARTICLE 6 CONDITIONS PRECEDENT TO OBLIGATIONS OF THE COMPANY",
  "subsection_name": "6.9 TAX OPINION",
  "text": "The Company shall have received a legal opinion from [COMPANY COUNSEL], counsel to the Company, dated as of the Closing Date, to the effect that for federal income tax purposes the Merger will constitute a reorganization within the meaning of section 368(a) of the Code.\nIn rendering such opinion, counsel to the Company may rely upon the tax representation letters referred to in Section 4.10.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 263,
  "section_name": "ARTICLE 7 TERMINATION",
  "subsection_name": "7.1 TERMINATION",
  "text": "This Agreement may be terminated prior to the Effective Time (whether before or after adoption of this Agreement by the Company’s stockholders):\n | (a) | by mutual written Consent of Parent and the Company;\n | (b) | by Parent or the Company if the Merger shall not have been\n | consummated by [11:59 p.m.] [ | ] Time on (the “End Date”); provided, that\n | the right to terminate this Agreement pursuant to this Section 7.1(b) shall not be available to a party whose failure to perform any material obligation required to be performed by such Party has been a cause of, or results in, the failure of the Merger to be consummated by the End Date;\n | (c) | by Parent or the Company if (i) a court of competent\n | jurisdiction or other Governmental Body shall have issued a final and nonappealable Order, or shall have taken any other action, having the effect of permanently restraining, enjoining, or otherwise prohibiting the Merger, or (ii) a Legal Requirement shall be in effect that makes consummation of the Merger illegal or otherwise prohibits or prevents the consummation of the Merger;\n | (d) | by Parent or the Company if (i) the Company Stockholders\n | Meeting (including any adjournments thereof) shall have been held and completed and\n | (ii) this Agreement shall not have been adopted at such meeting by the Required Stockholder Vote; provided, however, that (A) a Party shall not be permitted to terminate this Agreement pursuant to this Section 7.1(d) if the failure to obtain the Required Stockholder Vote is attributable to a failure on the part of such Party to perform any material obligation required to be performed by such Party, and (B) the Company shall not be permitted to terminate this Agreement pursuant to this Section 7.1(d) if the Company has not made the payment(s) required to be made to Parent pursuant to Section 7.3(a)(ii) and, if applicable, pursuant to Section 7.3(b);\n | (e) | by Parent if (i) the Company Board shall have failed to\n | recommend that the Company’s stockholders vote to adopt this Agreement, (ii) there shall have occurred a Change in Recommendation, (iii) the Company Board shall have approved, endorsed, or recommended any Acquisition Proposal, (iv) the Company shall have failed to include the Board Recommendation in the Proxy Statement, (v) the Company, or any of its Subsidiaries or any Representative of the Company or any of its Subsidiaries, shall have violated, breached, or taken any action inconsistent with any of the provisions set forth in Section 4.4 or Section 4.6, or (vi) the Company Board or any committee thereof shall have resolved or proposed to take any action described in clauses\n | (i) through (v) of this sentence;\n | (f) | by Parent (i) if any of the Company’s representations and\n\nwarranties shall have been inaccurate as of the date of this Agreement, such that the condition set forth in Section 5.1 would not be satisfied, or (ii) if (A) any of the Company’s representations and warranties become inaccurate as of a date subsequent to the date of this Agreement (as if made on such subsequent date), such that the condition set forth in Section 5.1 would not be satisfied if the condition were then being tested, and (B) such inaccuracy, if capable of cure, has not been cured by the Company within 10 Business Days after its receipt of written notice thereof, or (iii) if any of the Company’s covenants contained in this Agreement shall have been breached, such that the condition set forth in Section 5.2 would not be satisfied;\n(g) by the Company (i) if any of Parent’s representations and\nwarranties shall have been inaccurate as of the date of this Agreement, such that the condition set forth in Section 6.1 would not be satisfied, or (ii) if (A) any of Parent’s representations and warranties shall have become inaccurate as of a date subsequent to the date of this Agreement (as if made on such subsequent date), such that the condition set forth in Section 6.1 would not be satisfied if the condition were then being tested, and (B) such inaccuracy, if capable of cure, has not been cured by Parent within 10 Business Days after its receipt of written notice thereof, or (iii) if any of Parent’s covenants contained in this Agreement shall have been breached such that the condition set forth in Section 6.2 would not be satisfied; or (h) by Parent if, since the date of this Agreement, there shall have\nbeen a Company Material Adverse Effect.\nAny termination pursuant to this Section 7.1 (other than pursuant to Section 7.1(a)) shall be effected by written notice from the terminating party to the other parties.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 270,
  "section_name": "ARTICLE 7 TERMINATION",
  "subsection_name": "7.2 EFFECT OF TERMINATION",
  "text": "In the event of the termination of this Agreement as provided in Section 7.1, this Agreement shall be of no further force or effect; provided, however, that (a) this Section 7.2, Section 7.3, and Article 8 shall survive the termination of this Agreement and shall remain in full force and effect, and (b) the termination of this Agreement shall not relieve any Party from any liability for fraud or any material inaccuracy in or breach of any representation or any material breach of any warranty, covenant, or other provision contained in this Agreement.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 271,
  "section_name": "ARTICLE 7 TERMINATION",
  "subsection_name": "7.3 EXPENSES; TERMINATION FEES.",
  "text": "(a) Except as set forth in this Section 7.3, all fees and expenses\nincurred in connection with this Agreement and the transactions contemplated by this Agreement shall be paid by the Party incurring such expenses, whether or not the Merger is consummated; provided, however, that:\n(i) Parent and the Company shall share equally the filing fees incurred in connection with the filing by the Parties hereto of the pre-merger notification and report forms relating to the Merger under the HSR Act and the filing of any notice or other document under any applicable foreign Antitrust Law; and\n(ii) Company shall make a nonrefundable cash payment to Parent, in an amount equal to the aggregate amount of all fees and expenses (including all attorneys’ fees, accountants’ fees, financial advisory fees and filing fees) that have been paid or that may become payable by or on behalf of Parent in connection with the preparation and negotiation of this Agreement and otherwise in connection with the Merger (the “Expense Reimbursement”) if this Agreement is terminated (A) by Parent or the Company pursuant to Section 7.1(b) and on or before the date of any such termination, an Acquisition Proposal shall have been publicly announced or disclosed or an Acquisition Proposal has otherwise been communicated to the Company Board, or (B) by Parent or the Company pursuant to Section 7.1(d) or (C) by Parent pursuant to either Section 7.1(e) or Section 7.1(f).\nAny Expense Reimbursement required to be made (A) as the result of a termination of this Agreement by the Company pursuant to Section 7.1(b) or Section 7.1(d) shall be paid by the Company prior to the time of such termination; and (B) as the result of termination of this Agreement by Parent pursuant to Section 7.1(b), Section 7.1(d), Section 7.1(e) or Section 7.1(f) shall be paid by the Company within two Business Days after such termination.\n | (b) |  | The Company agrees to pay Parent (or its designees) an\n | --- | --- | ---\n | amount equal to $ (the “Termination Fee”) if this Agreement is terminated:\n | (i) by Parent pursuant to Section 7.1(e);\n | (ii) by Parent or the Company pursuant to Section 7.1(b) or by Parent pursuant to Section 7.1(f) and, in either case, (x) on or before the date of any such termination an Acquisition Proposal shall have been announced, disclosed, or otherwise communicated to the Company Board, and (y) a definitive agreement is entered into by the Company with respect to an Acquisition Transaction or an Acquisition Transaction is consummated within 18 months of such termination of the Agreement;\n\n(iii) by Parent or the Company pursuant to Section 7.1(d) and (x) on or before the date of the Company Stockholders Meeting by the Required Stockholder Vote an Acquisition Proposal shall have been announced, disclosed, or otherwise communicated to the Company Board, and (y) a definitive Agreement is entered into by the Company with respect to an Acquisition Transaction or an Acquisition Transaction is consummated within 18 months of such termination of the Agreement; or\n(iv) by any Party at any time during which the Agreement was otherwise terminable in a circumstance in which Parent would be entitled to payment of the Termination Fee pursuant to Section 7.3(b)(i), (ii) or (iii).\n | (c) | Any Termination Fee required to be paid (i) pursuant to\n | Section 7.3(b)(i) shall be paid within two Business Days after termination by Parent, (ii) pursuant to Section 7.3(b)(ii) or (iii) shall be paid within two Business Days after the event giving rise to such payment, and (iii) pursuant to Section 7.3(b)(iv), at the time such fee would be payable pursuant to Section 7.3(b)(i), (ii) or (iii), as applicable.\n | (d) | If the Company fails to pay when due any amount payable\n | under this Section 7.3, then (i) the Company shall reimburse Parent for all costs and expenses (including fees of counsel) incurred in connection with the enforcement by Parent of its rights under this Section 7.3, and (ii) the Company shall pay to Parent interest on such overdue amount (for the period commencing as of the date such overdue amount was originally required to be paid and ending on the date such overdue amount is actually paid to Parent in full) at a rate per annum equal to 3% over the “prime rate” (as published in The Wall Street Journal) in effect on the date such overdue amount was originally required to be paid.\n | (e) | The Parties acknowledge that the agreements contained in this\n",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 280,
  "section_name": "ARTICLE 7 TERMINATION",
  "subsection_name": "7.3 EXPENSES; TERMINATION FEES. > Section 7.3 are an integral part of the transactions contemplated by this Agreement and that, without these agreements, the Parties would not enter into this Agreement.",
  "text": "Payment of the fees and expenses described in this Section 7.3 shall not be in lieu of liability pursuant to Section 7.2(b).",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 281,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.1 AMENDMENT",
  "text": "This Agreement may be amended at any time prior to the Effective Time by the Parties (by action taken or authorized by their respective boards of directors, in the case of the Company and Merger Sub), whether before or after adoption of this Agreement by the stockholders of the Company or Merger Sub; provided, however, that after any such stockholder approval of this Agreement, no amendment shall be made to this Agreement that by law requires further approval or authorization by the stockholders of the Company or Merger Sub without such further approval or authorization.\nThis Agreement may not be amended, except by an instrument in writing signed by or on behalf of each of the Parties.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 282,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.2 REMEDIES CUMULATIVE; WAIVER.",
  "text": "(a) The rights and remedies of the Parties are cumulative and not\nalternative.\nNeither any failure nor any delay by any Party in exercising any right, power, or privilege under this Agreement or any of the documents referred to in this Agreement will operate as a waiver of such right, power, or privilege and no single or partial exercise of any such right, power, or privilege will preclude any other or further exercise of such right, power, or privilege or the exercise of any other right, power, or privilege.\nTo the maximum extent permitted by applicable Legal Requirements, (i) no waiver that may be given by a Party will be applicable except in the specific instance for which it is given; and (ii) no notice to or demand on one Party will be deemed to be a waiver of any obligation of that Party or of the right of the Party giving such notice or demand to take further action without notice or demand as provided in this Agreement or the documents referred to in this Agreement.\nthe Company) and the Company (with respect to Parent and Merger Sub), may, to the extent legally allowed, (i) extend the time for the performance of any of the obligations or other acts of such Party, (ii) waive any inaccuracies in the representations and warranties contained in this Agreement or any document delivered pursuant to this Agreement and (iii) waive compliance with any covenants, obligations, or conditions contained in this Agreement.\nAny agreement on the part of a Party to any such extension or waiver shall be valid only if set forth in a written instrument signed on behalf of such Party.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 285,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.3 NO SURVIVAL",
  "text": "None of the representations and warranties contained in this Agreement, or any covenant in this Agreement other than Section 4.17, shall survive the Effective Time.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 286,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT",
  "text": "This Agreement, including the schedules, exhibits, and amendments hereto, and the Confidentiality Agreement constitute the entire agreement among the Parties and supersede all other prior or contemporaneous agreements and understandings, both written and oral, among or between any of the Parties with respect to the subject matter hereof and thereof.\n8.5 EXECUTION OF AGREEMENT; COUNTERPARTS; ELECTRONIC SIGNATURES.\n | (a) | The Agreement may be executed in several counterparts, each\n | of which shall be deemed an original and all of which shall constitute one and the same instrument and shall become effective when counterparts have been signed by each of the Parties and delivered to the other Parties; it being understood that all Parties need not sign the same counterpart.\n | (b) other document contemplated by this Agreement (including any amendment or any other change thereto) by any electronic means intended to preserve the original graphic and pictorial appearance of a document shall constitute effective execution and delivery of this Agreement as to the Parties and may be used in lieu of an original Agreement or other document for all purposes. Signatures of the Parties transmitted by any electronic means referenced in the preceding sentence shall be deemed to be original signatures for all | The exchange of signed copies of this Agreement or of any\n | (c) | Notwithstanding the E-SIGN Act or any other Legal\n\nRequirement relating to or enabling the creation, execution, delivery, or recordation of any contract or signature by electronic means, and notwithstanding any course of conduct engaged in by the Parties, no Party shall be deemed to have executed this Agreement or any other document contemplated by this Agreement (including any amendment or other change thereto) unless and until such Party shall have executed this Agreement or such document on paper by a handwritten original signature or any other symbol executed or adopted by a Party with current intention to authenticate this Agreement or such other contemplated document and an original of such signature has been exchanged by the Parties either by physical delivery or in the manner set forth in Section 8.5(b).\n“Originally signed” or “original signature” means or refers to a signature that has not been mechanically or electronically reproduced.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 290,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.6 GOVERNING LAW",
  "text": "This Agreement and the agreements, instruments, and documents contemplated hereby, shall be governed by, and construed in accordance with, the Legal Requirements of the State of Delaware, without regard to any applicable principles of conflicts of law that might require the application of the Legal Requirements of any other jurisdiction.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 291,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.7 EXCLUSIVE JURISDICTION; VENUE",
  "text": "In any action or proceeding between any of the Parties arising out of or relating to this Agreement or any of the Contemplated Transactions, each of the Parties: (a) irrevocably and unconditionally consents and submits to the exclusive jurisdiction and venue of the Court of Chancery of the State of Delaware or to the extent such court does not have subject matter jurisdiction, the Superior Court of the State of Delaware or the United States District Court for the District of Delaware, (b) agrees that all claims in respect of such action or proceeding shall be heard and determined exclusively in accordance with clause (a) of this Section, (c) waives any objection to laying venue in any such action or proceeding in such courts, (d) waives any objection that such courts are an inconvenient forum or do not have jurisdiction over any party, and (e) agrees that service of process upon such party in any such action or proceeding shall be effective if such process is given as a notice in accordance with Section 8.12 of this Agreement.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 292,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.8 WAIVER OF JURY TRIAL",
  "text": "Each of the parties irrevocably waives any and all rights to trial by jury in any action or proceeding between the Parties arising out of or relating to this Agreement and the Contemplated Transactions.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 293,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.9 DISCLOSURE SCHEDULES.",
  "text": " | (a) Schedule shall be arranged in separate Parts corresponding to the numbered and lettered sections contained in Article 2 and Article 3, respectively. The information disclosed in any numbered or lettered Part shall be deemed to relate to and to qualify only the particular representation or warranty set forth in the corresponding numbered or lettered section in Article 2 or Article 3, as the case may be, and shall not be deemed to relate to or to qualify any other representation or warranty. | The Company Disclosure Schedule and the Parent Disclosure\n | (b) | Every statement made in the Company Disclosure Schedule\n\nshall be deemed to be a representation of the Company in this Agreement as if set forth in Article 2.\nEvery statement made in the Parent Disclosure Schedule shall be deemed to be a representation of Parent in this Agreement as if set forth in Article 3.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 295,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.10 ASSIGNMENTS AND SUCCESSORS",
  "text": "No Party may assign any of its rights or delegate any of its obligations under this Agreement without the prior written Consent of the other Parties.\nAny attempted assignment of this Agreement or of any such rights or delegation of obligations without such consent shall be void and of no effect This Agreement will be binding upon, and shall be enforceable by and inure solely to the benefit of, the parties hereto and their respective successors and permitted assigns.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 296,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.11 NO THIRD-PARTY RIGHTS",
  "text": "Nothing in this Agreement, express or implied, is intended to or shall confer upon any Person (other than the Parties) any right, benefit, or remedy of any nature whatsoever under or by reason of this Agreement; provided, however, that after the Effective Time, the Indemnified Persons shall be third-party beneficiaries of, and entitled to enforce, Section 4.17, and provided further that no Consent of the Indemnified Persons shall be required to amend any provision of the Agreement prior to the Effective Time.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 297,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.12 NOTICES",
  "text": "All notices and other communications hereunder shall be in writing and shall be delivered by hand, by facsimile, or by overnight courier service (except for notices specifically required to be delivered orally).\nSuch communications shall be deemed given to a Party (a) at the time and on the date of delivery, if delivered by hand or by facsimile (with, in the case of delivery by facsimile, confirmation of date and time of transmission by the transmitting equipment, and such delivery by facsimile subsequently confirmed with a copy delivered as provided in clause (b) on the next Business Day) and (b) at the end of the first Business Day following the date on which sent by overnight service by a nationally recognized courier service (costs prepaid).\nSuch communication in each case shall be delivered to the following addresses or facsimile numbers and marked to the attention of the person (by name or title) designated below (or to such other address, facsimile number, or person as a Party may designate by notice to the other Parties):",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 299,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.12 NOTICES > Company: Attention: Fax no.:",
  "text": "with a copy to (which shall not constitute notice hereunder): Attention:",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 300,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.12 NOTICES > Parent and Merger Sub: Attention: Fax no.:",
  "text": "with a copy to (which shall not constitute notice hereunder): Attention:",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 301,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.13 CONSTRUCTION; USAGE.",
  "text": "(a) In this Agreement, unless a clear contrary intention appears:\n(b) This Agreement was negotiated by the Parties with the benefit of legal representation and any rule of construction or interpretation otherwise requiring this Agreement to be construed or interpreted against any Party shall not apply to any construction or interpretation hereof.\n(c) The headings contained in this Agreement are for convenience of reference only, shall not be deemed to be a part of this Agreement, and shall not be referred to in connection with the construction or interpretation of this Agreement.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 304,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.14 ENFORCEMENT OF AGREEMENT",
  "text": "The Parties acknowledge and agree that Parent and Merger Sub would be irreparably damaged if any of the provisions of this Agreement are not performed in accordance with their specific terms and that any breach of this Agreement by the Company could not be adequately compensated by monetary damages alone.\nAccordingly, in addition to any other right or remedy to which Parent or Merger Sub may be entitled, at law or in equity, it shall be entitled, without proof of damages, to enforce any provision of this Agreement by a decree of specific performance and temporary, preliminary, and permanent injunctive relief to prevent breaches or threatened breaches of any of the provisions of this Agreement, without posting any bond or other undertaking.\nIn the event that any action shall be brought by Parent or Merger Sub in equity to enforce the provisions of the Agreement, the Company shall not allege, and hereby waives the defense, that there is an adequate remedy at law or that the award of specific performance is not an appropriate remedy for any reason of law or equity.",
  "source": "ModelMergerAgreement.pdf"
}
{
  "chunk_index": 305,
  "section_name": "ARTICLE 8 MISCELLANEOUS PROVISIONS",
  "subsection_name": "8.4 ENTIRE AGREEMENT > 8.15 SEVERABILITY",
  "text": "If any provision of this Agreement is held invalid, illegal, or unenforceable by any court of competent jurisdiction, the other provisions of this Agreement will remain in full force and effect, so long as the economic or legal substance of the transactions contemplated by this Agreement is not affected in any manner materially adverse to any Party.",
  "source": "ModelMergerAgreement.pdf"
}
